package com.zju.campustour.model.database.data;

import com.zju.campustour.R;

/**
 * Created by Administrator on 2016/7/9.
 */
public class MajorData {
    public static String[] majorGroup = new String[]{"哲学","经济学","法学","教育学","文学","历史学","理学","工学","农学","医学","管理学","艺术学"};
    public static int[] majorColorGroup = new int[]{R.color.colorPrimary, R.color.mediumpurple,R.color.lightsalmon,R.color.peru,R.color.hotpink,R.color.salmon,
    R.color.sandybrown,R.color.violet,R.color.lightcoral,R.color.forestgreen,R.color.tomato,R.color.darkgreen};


    //哲学
    public static String[] zhexueMajorNames = new String[]{
            "逻辑学","伦理学","哲学","宗教学"
    };

    public static int[] zhexueMajorClass = new int[]{0,0,0,0};
    public static String[] zhexueMajorcodes = new String[]{
            "10102","10104","10101","10103"
    };
    public static String[] zhexueMajorAbstracts = new String[]{
            "逻辑学专业学生主要学习逻辑学、数学、计算机科学和哲学方面的基本理论和基础知识，受到公理化方法、形式化方法和语义分析方面的基本训练，" +
                    "比较系统地掌握逻辑学专业的基础知识、专业知识以及马克思主义哲学的基本理论和方法，了解当代世界主要逻辑和哲学思潮，" +
                    "具有一定的社会科学、自然科学和思维科学的基础知识，有较强的理论思维能力、社会活动能力、表达能力和专业研究的基本能力。" +
                    "\n毕业生应获得以下几方面的知识和能力：" +
                    "\n1. 掌握马克思主义的基本原理和逻辑学的基本理论、基础知识；" +
                    "\n2. 具有数学、计算机科学和哲学的基本素养；" +
                    "\n3. 掌握逻辑学研究的基本方法；" +
                    "\n4.了解现代逻辑的前沿问题与发展动态；" +
                    "\n5. 掌握文献检索、资料查询的基本方法和手段；\n" +
                    "6. 具有初步的教学、科研和实际工作能力。",
            "该专业学生主要学习宗教学的基本理论，较全面地了解世界各大宗教的历史与现状，以及我国的宗教法规和政策，受到独立思考、分析问题、社会调研等方面的基本训练。" +
                    "\n通过学习，将具备以下几方面的能力：\n" +
                    "1. 掌握马克思主义的基本原理和伦理学的基本理论，具有关于中外伦理学史的基本知识；\n" +
                    "2. 能运用马克思主义的伦理学的基本理论，分析社会主义社会的伦理道德问题，有分析有鉴别地对待中外伦理学的历史遗产和现代资产阶级伦理学的主要流派；\n" +
                    "3. 具有较强的文字与口头表达能力和初步的科研能力，以及从事社会主义精神文明建设、特别是社会主义道德建设的实际工作能力；\n" +
                    "4. 具有独立思考、分析问题的基本能力；\n" +
                    "5. 掌握文献检索、社会调查的基本方法，具有初步的教学、科研和实际工作能力；\n" +
                    "6. 具有较强的阅读该专业书刊的能力，一定的听、写和说的能力。",
            "哲学专业培养具有一定马克思主义哲学理论素养和系统的专业基础知识，能运用科学的世界观和方法论分析当代世界与中国的现实问题，具有一定的哲学理论思维能力、创新能力、" +
                    "口头与文字表达能力、社会活动能力和一定的科研能力，具有较高外语水平的理论研究人才以及能在国家机关、文教事业新闻出版、企业等部门从事实际工作的应用型、复合型高级专门人才。" +
                    "\n毕业生应获得以下几方面的知识和能力：\n" +
                    "1.比较系统地掌握马克思主义哲学、中国哲学和西方哲学的理论和历史；\n" +
                    "2.具有一定的社会科学、人文科学、自然科学、思维科学的相关知识；\n" +
                    "3.掌握哲学学科的基本研究方法、治学方法和相应的社会调查能力；\n" +
                    "4.了解国内外哲学界最重要的理论前沿和发展动态；\n" +
                    "5.了解国内外最重大的实践问题和发展动态；\n" +
                    "6.具有分析和解决社会现实问题的初步能力。",
            "宗教学专业学生主要学习宗教学的基本理论，较全面地了解世界各大宗教的历史与现状，以及我国的宗教法规和政策，受到独立思考、分析问题、社会调研等方面的基本训练。" +
                    "\n毕业生应获得以下几方面的知识和能力：\n" +
                    "1.掌握马克思主义的基本原理和宗教学的基本理论，具有关于世界主要宗教的基本知识；\n" +
                    "2.掌握现代宗教学的主要研究方法；\n" +
                    "3.了解世界宗教的发展动态和宗教研究的前沿问题；\n" +
                    "4.了解我国的宗教法规和政策；\n" +
                    "5. 具有独立思考、分析问题的基本能力；\n" +
                    "6. 掌握文献检索、社会调查的基本方法，具有初步的教学、科研和实际工作能力。"
    };


    //经济学 10
    public static String[] jingjixueMajorNames = new String[]{
            "商务经济学","经济学","能源经济学","经济统计学","金融工程","投资学","金融学","财政学","税收学","国际经济与贸易"
    };
    public static int[] jingjixueMajorClass = new int[]{1,1,1,1,1,1,1,1,1,1};
    public static String[] jingjixueMajorcodes = new String[]{
            "020105","020101","020106T","020102","020302","020304","020301K","020201K","020202","620303"
    };
    public static String[] jingjixueMajorAbstracts = new String[]{
            "商务经济学专业方向培养具备经济、贸易、文化、传播、法律、管理等方面的基础知识，掌握当代国际文化贸易的现状和发展趋势，熟悉通行的国际文化贸易规则、惯例以及中国对外文化贸易的政策法规，了解文化产业的发展特点和运行机制，" +
                    "能在广播电视机构或其他文化机构、涉外经济贸易部门、企事业单位以及政府机构从事对外文化贸易、管理、研究、发行和策划等方面工作的专门人才。" +
                    "\n商务经济学专业学生毕业后可可以到国家经济部门或私人贸易公司工作的机会，可以选择以下几个方面职业：\n" +
                    "1.经济预测和计划\n" +
                    "2.财务分析/财务机构的信贷分析\n" +
                    "3.市场调查员和分析员\n" +
                    "4.保险证券分析员\n" +
                    "5.经理顾问\n" +
                    "6.工业经济学家\n" +
                    "7.效益分析员\n" +
                    "8.在国际机构或组织工作，如世界银行，亚洲开发银行",
            "经济学主要课程：政治经济学、《资本论》、西方经济学、统计学、国际经济学、货币银行学、财政学、经济学说史、发展经济学、企业管理、市场营销、国际金融、国际贸易、线性代数、高等数学、概率论与数理统计等。" +
                    "\n核心能力：\n" +
                    "l. 掌握经济学的基本理论和分析方法；\n" +
                    "2. 掌握现代经济分析方法和计算机应用技能；\n" +
                    "3. 了解中外经济学的学术动态及应用前景；\n" +
                    "4. 了解中国经济体制改革和经济发展；\n" +
                    "5. 熟悉党和国家的经济方针、政策和法规；\n" +
                    "6. 掌握中外经济学文献检索、资料查询的基本方法、具有一定的经济研究和实际工作能力。\n",
            "能源经济学作为经济学一个新的分支，起始于20世纪70年代的石油冲击。20世纪80年代中期以后，随着环境问题的凸显，能源可持续性问题被提到议事日程上。" +
                    "同时，国外一些著名大学如耶鲁大学、哈佛大学、麻省理工、斯坦福大学等纷纷设立能源研究中心，开设能源经济方面课程。" +
                    "\n能源经济专业于2010年8月经教育部批准设立，2011年开始招生，只招收理科生。主要培养面向21世纪的具有较高专业素养、较强应用技能和科研能力的能源经济专门人才。它将能源和经济结合起来，" +
                    "包括能源的战略选择、能源的融资、能源的预测、能源企业的组织形式等，以能源为研究对象，涉及到经济管理方面的内容。" +
                    "该院在德州已建立实习基地，将来将安排学生到实习基地参与企业运营，通过锻炼提高实际能力。" +
                    "\n授课方式主要包括专业学习和实习。学制四年，授予经济学学士学位。\n" +
                    "1.具备良好的数量基础，掌握管理学、经济学方面的基本理论知识和方法；\n" +
                    "2.掌握能源经济学基本理论、基本方法，具备能源结构分析、能源市场分析、能源供给需求预测等方面的能力；\n" +
                    "3.掌握能源战略与政策、环境管制政策、以及能源环境产业发展规划等方面的专业知识，具备从事在相关领域工作的能力基础；\n" +
                    "4.掌握能源金融、能源项目管理、能源国际合作、能源市场开发等方面的知识与方法，具备从事这些方面相关分析的能力基础；\n" +
                    "5.了解能源技术与环境科学的基础知识与能源技术经济评价等方面的方法；\n" +
                    "6.了解新能源与可再生能源的资源状况、了解相关原理与关键技术、掌握新能源与可再生能源发展的相关政策及研究进展，具备在该领域工作的知识基础和能力。",
            "经济统计学专业是统计学在经济领域中的应用学科，是以经济数据为研究对象，包括经济数据的采集、生成和传输，用统计方法分析经济数据背后的经济现象以及复杂经济系统的规律，从而为经济和管理决策服务。" +
                    "\n具备技能：\n" +
                    "1．具有坚实的经济学和数学基础；\n" +
                    "2．掌握统计学的基本理论和方法，具有采集、加工和分析数据的基本能力；\n" +
                    "3．具备运用计算机和相关统计软件分析、解决实际问题的能力；\n" +
                    "4．具备良好的创新意识和开拓精神；\n" +
                    "5．具有较强的中、英文综合运用的能力；",
            "金融工程（Financial Engineering）专业兴起于20世纪90年代初，是综合运用数学、统计学和计算机编程技术来解决金融问题的崭新领域。" +
                    "\n主干课程：\n" +
                    "经济学模块；金融学模块；计算机模块；数学与统计模块等四大模块。开设课程有：政治经济学、微观经济学、宏观经济学、计量经济学、货币银行学、金融经济学，金融市场学，证券投资学，衍生金融工具，固定收益证券，公司金融，金融工程学，金融会计、" +
                    "随机过程，时间序列分析，金融统计与分析应用，商业银行经营与管理，保险与精算，博弈论与信息经济学，金融风险管理，投资银行学，国际金融，国际投资，金融法等。",
            "投资学研究如何把个人、机构的有限资源分配到诸如股票、国债、不动产等（金融）资产上，以获得合理的现金流量和风险/收益率。其核心就是以效用最大化准则为指导，获得个人财富配置的最优均衡解。" +
                    "\n培养目标:\n" +
                    "该专业具有融实务投资、金融投资和人力资本投资于一体，微观与宏观相结合，国内与国际相交叉，财经管理、法律和理工知识相渗透，重点培养学生从事各类投资活动的决策和管理能力等特点。\n" +
                    "要求学生有扎实的投资学专业基础理论知识，具有较宽的专业知识面，掌握财经、法律、管理的基本知识和技能，具备定性分析和定量分析及外国语言阅读交流的基本能力。",
            "金融学（Finance）是从经济学中分化出来的应用经济学科，是以融通货币和货币资金的经济活动为研究对象，具体研究个人、机构、政府如何获取、支出以及管理资金以及其他金融资产的学科。\n" +
                    "金融学专业培养具备金融学方面的理论知识和业务技能，能在银行、证券、投资、保险及其他经济管理部门和企业从事相关工作的专门人才。" +
                    "\n核心能力：\n" +
                    "1．掌握金融学科的基本理论、基本知识；\n" +
                    "2．具有处理银行、证券、投资与保险等方面业务的基本能力；\n" +
                    "3．熟悉国家有关金融的方针、政策和法规；\n" +
                    "4．了解本学科的理论前沿和发展动态；\n" +
                    "5．掌握文献检索、资料查询的基本方法，具有一定的科学研究和实际工作能力。",
            "财政学专业属于应用经济学科，它主要研究政府部门在资金筹集和使用方面的理论、制度和管理方法，同时也研究企业在生产经营过程中的税收问题。\n" +
                    "该专业培养具备财政、税务等方面的理论知识和业务技能，能在财政、税务及其他经济管理部门和企业从事相关工作的高级专门人才。" +
                    "\n毕业生应获得以下几方面的知识和能力：\n" +
                    "1. 掌握财政学科的基本理论、基本知识；\n" +
                    "2. 具有处理财政税收业务的基本能力；\n" +
                    "3. 熟悉国家有关财政、税收的方针、政策和法规；\n" +
                    "4. 了解本学科的理论前沿和发展动态；\n" +
                    "5. 掌握文献检索、资料查询的基本方法，具有一定的科学研究和实际工作能力。",
            "税收学专业培养具备税务及管理、法律等方面的知识，具有创新精神、实践能力和自我发展能力，具有良好的职业道德，能够胜任税务机关、企事业单位、" +
                    "税务中介机构等部门的实际工作及大中专学校和研究单位的教学与研究工作的应用型专门人才。" +
                    "\n就业方向：\n" +
                    "主要在税务师事务所、会计师事务所、财务公司等税务咨询代理机构及财政、税务等政府部门、银行、工商企事业单位从事税务、财务相关工作。",
            "国际经济与贸易（International Economics and Trade 或 International Business and Trade ）大学专业，该专业培养能较系统地掌握经济学基本原理和国际经济、国际贸易的基本理论，" +
                    "掌握国际贸易的基本知识和基本技能的人才。" +
                    "\n培养具有较强国际贸易实际能力，主要从事进出口业务、外贸企业管理、国际经济技术合作、跨国经营等对外经济和对外贸易活动的高级技术应用性专门人才。" +
                    "\n专业核心课程与主要实践环节：外贸英语、西方经济学、管理学、国际贸易地理、国际贸易、国际贸易实务、国际金融、国际市场营销、货币银行学、外贸会计、电子商务概论、" +
                    "中国对外贸易政策法规、国际贸易规则与惯例、模拟实训、毕业实习、毕业论文等，以及各校的主要特色课节。"
    };

    //法学 12
    public static String[] faxueMajorNames = new String[]{
            "法学","知识产权","社会学","人类学","家政学","侦察学","治安学","经济犯罪侦察","外交学","国际政治经济学","国际事务","政治学与行政学"
    };
    public static int[] faxueMajorClass = new int[]{2,2,2,2,2,2,2,2,2,2,2,2};
    public static String[] faxueMajorcodes = new String[]{
            "030101K","030102T","030301","030303T","030305T","030602K","030601K","030606TK","030203","030401","030407S","030201"
    };
    public static String[] faxueMajorAbstracts = new String[]{
            "法学专业培养系统掌握法学知识，熟悉我国法律和党的相关政策，能在国家机关、企事业单位和社会团体、" +
                    "特别是能在立法机关、行政机关、检察机关、审判机关、仲裁机构和法律服务机构从事法律工作的高级专门人才。" +
                    "\n毕业生应获得以下几方面的知识和能力：\n" +
                    "1．掌握法学各学科的基本理论与基本知识；\n" +
                    "2．掌握法学的基本分析方法和技术；\n" +
                    "3．了解法学的理论前沿和法制建设的趋势；\n" +
                    "4．熟悉我国法律和党的相关政策；\n" +
                    "5．具有运用法学知识去认识问题和处理问题的能力；\n" +
                    "6．掌握文献检索、资料查询的基本方法，具有一定的科学研究和实际工作的能力。",
            "知识产权专业培养能在律师事务所、专利事务所、商标事务所等从事商标代理、专利代理等专门知识产权事务，同时也能在公、检、法等部门从事专门的知识产权司法审判及其他法律事务，" +
                    "或者在版权局、商标局、专利局、科技局等部门从事知识产权管理事务的知识产权专门人才。" +
                    "\n该专业学生主要学习法学的基本理论和基本知识，受到法学思维和法律实务的基本训练，具有运用法学理论和方法分析问题和运用法律管理事务与解决问题的基本能力。" +
                    "\n应获得以下几方面的知识和能力：\n" +
                    "1．具备知识产权专业各学科的基本理论和基本知识，同时兼具普通法学各学科基本理论和基本知识；\n" +
                    "2．掌握知识产权专业知识和专业技能，同时具备法学一般分析方法和技术；\n" +
                    "3．了解知识产权发展的前沿和知识产权发展的趋势；\n" +
                    "4．熟悉我国知识产权法律体系和相关政策体系及普通法律体系和政策；\n" +
                    "5．运用知识产权知识解决和处理知识产权代诉讼和管理问题的能力；\n" +
                    "6．掌握专利和商标检索、资料查询的技能和方法，同时具有一般文献检索、资料查询的基本方法，能尽快解决文献检索和查询的问题。",
            "社会学专业培养具备较全面的社会学理论知识和较熟练的社会调查技能。能够在教育、科研机构、党政机构、企事业单位、社会团体中从事社会的研究与调查工作。" +
                    "也是培养政策研究与评估、社会规划与管理、发展研究与预测等工作的高级专门人才。" +
                    "\n毕业生应获得以下几方面的知识和能力：\n" +
                    "1．掌握马克思主义基本原理和社会学的基本理论、基本知识，熟悉中外社会学主要学派与学说，并善于运用马克思主义理论分析各种具有重大影响的社会理论和思潮；\n" +
                    "2．熟练掌握社会学调查方法和技能，及社会统计方法：\n" +
                    "3．了解国情，善于分析各种社会现象和问题，具有初步的科学研究能力和较强的论文写作和语言表达能力；\n" +
                    "4．了解党和政府的重大方针、政策、法律和法规，了解国内外的重要事件及其发展；\n" +
                    "5．了解现代社会学的前沿理论及重要研究领域中的新进展；\n" +
                    "6．掌握文献检索，资料查询的基本方法和手段。",
            "人类学是从生物和文化的角度对人类进行全面研究的学科群。目前也有了新兴的就业方向，比如游戏策划。" +
                    "\n本专业培养掌握人类学、社会学、文化学基本理论和方法的德智体全面发展、具有现代科学思想和优良人文素质的专门人才。" +
                    "\n本专业学生兼修文化人类学、考古人类学、语言人类学、体质人类学四方面的课程，强调知识传授的系统性，注重社会经济文化调查方法技术的训练，注意提高研究技能以及进行应用研究的能力。" +
                    "同时，注意拓宽专业口径，增加交叉学科、实用性的课程以满足国家建设与社会经济文化发展对人才的要求。",
            "家政学专业培养具备系统家政学基本理论和相关专业知识，掌握家政管理、营养调配、社区服务、家庭教育等专业技能，能够在城乡社区、家庭服务业、企事业单位、医院、军队、学校、政府机关等部门从事与提高全民生活质量相关工作的高素质家政学专门人才。" +
                    "\n主要课程：\n" +
                    "社会学概论、社会医学、社会心理学、生活科学概论、应用营养学、优生学、儿童保育与教育、心理咨询与辅导、家庭医学、社会保障、家庭投资理财、生活美学、老年学、公共事业管理、家庭伦理学、婚姻与家庭咨询" +
                    "\n就业方向：\n" +
                    "家政学专业毕业生能在政府部门和民政系统、妇联系统、社会工作系统、社区指导、服务与管理机构、物业管理机构等从事生社区管理与服务、生活与家庭教育指导、婚姻与家庭咨询等工作，能在中小学校和学前教育机构从事生活教育、生活管理等工作；能在企事业单位从事职工保健与生活管理等工作；从事生活科学产业的开发、组织和运作，如家庭产品、老年用品的开发、医疗保健用品的推广等。",
            "侦查学专业培养具有坚定正确的政治方向、严格的组织纪律观念、良好的职业道德，有为维护国家安全、社会安定而献身的精神，熟悉我国公安工作的路线、方针、政策和相关法律、法规，系统掌握侦查学专业的基本理论、基本知识和基本技能，能在公安、检察、国家安全等部门从事侦查工作、刑事执法工作、预防和控制犯罪以及侦查学教学、科研等方面工作的高级专门人才。" +
                    "\n侦查学是刑事法学的重要分支，它以侦查活动及其规律、侦查制度和侦查理论、犯罪活动的规律及特点为研究对象的科学；是从属于法学门类集科学性、实践性为一体的综合性应用科学。" +
                    "\n毕业生应获得以下几方面的知识和能力\n" +
                    "1．掌握法学、侦查学的基本理论、基础知识；\n" +
                    "2．掌握侦查手段和侦查技术；\n" +
                    "3．具有较强的侦查指挥、刑事执法的基本能力；\n" +
                    "4．熟悉公安工作的方针、政策和法规；\n" +
                    "5．掌握擒拿格斗技术、警用武器应用技术等技能，身体素质达到规定标准；\n" +
                    "6．掌握公安研究的基本方法，具有一定的教学、科学研究和实际工作能力。",
            "该专业学生主要学习治安学、行政法学、行政管理学、安全防范技术、侦查学等方面的基本理论和基本知识，接受公安行政执法和犯罪预防等方面的基本训练，具有管理社会治安，预防处置治安案件、治安事件与治安灾害事故，指导和监督企、事业单位内部治安保卫工作的基本能力。" +
                    "\n毕业生应获得以下几方面的知识和能力：\n" +
                    "1．掌握治安学、行政法学、行政管理学、安全防范技术学、侦查学等方面的基本理论、基本知识；\n" +
                    "2．掌握治安管理方法和安全防范技术；\n" +
                    "3．具有管理大、中城市社会治安、处理各种治安问题的初步能力；\n" +
                    "4．熟悉党和国家有关公安工作及社会治安工作的方针、政策和法规；\n" +
                    "5．掌握通讯、驾驶、射击、自卫擒敌等技能，身体素质达到规定标准；\n" +
                    "6．掌握公安研究的基本方法，具有一定的教学、科学研究和实际工作能力。",
            "经济犯罪侦查专业培养熟悉我国公安工作的基本路线、方针、政策和相关的法律法规，掌握经济犯罪侦查工作的基本知识和技能，能从事经济犯罪侦查工作的高级技术应用性专门人才。" +
                    "\n该专业学生能够系统地学习刑事法学、经济法学、案件侦查、物证技术等专业的基本理论和基础知识，能够熟练地运用侦查策略方法和刑事科学技术。" +
                    "\n就业方向：\n可在检察、纪检部门、公安部门以及企事业单位相关岗位工作。",
            "外交学专业培养具有一定的马克思主义理论素养和强烈的爱国心，对国际事务和中国外交有系统全面的了解，有交际和谈判的能力，在政治、业务、作风、纪律和语言方面具有较高的综合素质，能在外交和其他外事部门从事实际工作、国际问题研究和教学工作的外交学高级专门人才。" +
                    "\n该专业学生主要学习外语、外交学和国际政治、法律、经济知识，接受有关理论、发展历史和现状等方面的系统教育。\n" +
                    "毕业生应获得以下几方面的知识和能力：\n" +
                    "1．掌握马克思主义的基本原理和关于国际关系的基本理论；\n" +
                    "2．能熟练地运用一门外语独立从事工作；\n" +
                    "3．掌握该专业的基本理论、基础知识以及与该专业有关的国际法、国际经济和国际政治等学科的知识；\n" +
                    "4．有较强的汉语基本功和写作能力，以及交际和谈判的能力；\n" +
                    "5．具有一定的实际工作能力和调研能力，以及从事国际问题研究的初步能力。",
            "国际政治经济学从古典政治经济学、现代经济学、国际政治和国际关系理论的发展中，国际政治经济学获得了重要的思想源泉和理论支持。在美英等西方国家学者的带领下，国际政治经济学创立并逐步发展壮大，现已成为研究世界范围内政治、经济和社会重大问题的基础性学科。" +
                    "\n本专业面向国家外交机关、外事部门、涉外企事业单位、高等院校和科研机构，培养从事外交、外事和涉外工作，以及教学和科研工作的理论型和应用型专门人才。主要学习和研究国际关系中经济要素与政治及其他因素的关系。在注重国际关系基本理论教学的基础上，侧重亚太地区，以东北亚区域政治和国家关系为教学和科研重点。要求学生熟练地掌握一门外语和计算机操作技能。" +
                    "\n本专业主要培养学生掌握比较全面的国际知识、具有开阔的国际视野、较强的交际与沟通能力；同时要求学生熟练地掌握一门外语和计算机操作技能。\n" +
                    "通过学习，将具备以下几方面的能力：\n" +
                    "1.熟悉和了解国际关系史和西方政治思想史；\n" +
                    "2.能够从国际政治与世界经济结合的角度认识和分析国际社会的现实，并具有较强的分析能力和判断能力；\n" +
                    "3.要充分了解中国的对外战略和国际地位；\n" +
                    "4.了解世界主要国家和地区的政治经济、外交战略和对外关系，并具有比较分析的能力；\n" +
                    "5.要求学生比较熟练地掌握一门外语，具有较强的外语阅读、翻译能力和较好的听说能力；\n" +
                    "6.要求有较强的外事工作能力。",
            "国际事务专业是一门新兴专业，它的出现是适应现今国际社会关系发展的。随着国家和国家之间相互关系的日益密切，对外交交往的主体也不仅仅是局限于政府或者是国家的代表，而是会有更多的人与组织以不同的模式参与进来，包括企业、一些其他的非政府组织甚至是个人，还有网络。由于贸易、经济、文化交流的关系，而催生出国际事务这个对国际社会的各种关系理解都更为广泛的专业，相对与过去的国际政治而言，它具有一定的平民化色彩，有很大的发展空间。" +
                    "\n国际事务（lnternational Affairs）专业，旨在通过较系统的学习，培养德、智、体全面发展，具有一定马克思主义理论素养和高度的爱国主义精神，能适应我国加入WTO后各种国际事务管理的需要，系统和全面掌握国际事务的有关知识，具有相关管理、交际和谈判的能力，在政治、业务、作风、纪律和外语方面具有较高的综合素质，能在党政机关、企事业单位、涉外机构、国际组织、高等院校、科研单位、新闻和文化部门从事涉外事务管理、对外交流，以及教学和国际问题研究的国际事务专门人才。" +
                    "\n外交学（国际事务）是武汉大学在我国对外开放和融入经济全球化的新形势下开办的新专业，旨在培养适应经济全球化条件下国际事务管理所需要的复合型高素质人才。\n" +
                    "本专业主要有四个方面的特色：\n" +
                    "（1）交叉性强。本学科构建了涉及国际事务的多种学科的立体教学平台，由国际关系、外交学、外事管理、世界政治经济、国际法和公共管理等学科有机结合而构成。\n" +
                    "（2）强调实际应用和基础理论并重。为了培养具有扎实的专业知识和理论基础，并具备分析和解决实际问题能力的人才，本专业在注重基本理论课程的同时，还特别注重为学生提供了解和参与国际事务管理的实践机会。\n" +
                    "（3）重视国际合作，提高教学质量。为帮助学生扩大视野和掌握最新学术动态，本专业将经常聘请国内外专家来院授课和作学术报告，以保证教学内容不断更新，教学水平不断提高。同时，还将通过各种渠道，为学生提供出国、出境交流学习的机会。\n" +
                    "（4）吸收和借鉴国外的教学内容和方法，加强双语教学。本专业部分课程将选择国外原版教材，实行双语教学，并将在整个教学中不断增加双语教学课程的比重。",
            "政治学与行政学专业培养具有一定马克思主义理论素养和政治学、行政学方面的基本理论和专门知识，能在党政机关、新闻出版机构、企事业和社会团体等单位从事教学科研、行政管理等方面工作的政治学和行政学高级专门人才。" +
                    "\n本专业学生主要学习政治学、行政学、国际政治学和法学等方面的基础理论和基本知识，受到政治学研究、公共政策分析、社会调查与统计等方面的基本训练，掌握调查研究、分析判断和协调组织等方面的基本能力。\n" +
                    "毕业生应获得以下几方面的知识和能力：\n" +
                    "1.掌握马克思主义基本原理和政治学、行政学、国际政治学和法学的基本理论知识；\n" +
                    "2.掌握辩证唯物主义和历史唯物主义的基本观点和分析方法，以及系统分析、统计分析、调查分析等科学方法或技术；\n" +
                    "3.具有在党政机关、社会团体、新闻出版机构、教育及其他企事业单位从事科研、教学、行政管理以及其他有关专门业务工作的基本能力；\n" +
                    "4.了解有关政治体制、决策过程以及党政管理法律、制度、方针、政策；\n" +
                    "5.了解政治学及行政学、法学、国际政治学和管理科学等相关学科的发展动态；\n" +
                    "6.掌握文献检索和资料查询的基本方法和手段，具有一定的科学研究和实际工作能力。"
    };

    //教育学 6
    public static String[] jiaoyuxueMajorNames = new String[]{
            "教育学","学前教育","教育技术学","体育教育","运动人体科学","社会体育"
    };
    public static int[] jiaoyuxueMajorClass = new int[]{3,3,3,3,3,3};
    public static String[] jiaoyuxueMajorcodes = new String[]{
            "040101","660214","040104","040201","040205","660303"
    };
    public static String[] jiaoyuxueMajorAbstracts = new String[]{
            "教育学是研究教育现象和教育问题、解释教育规律的科学。其主干学科是教育学和心理学，报考该专业的考生应关注我国教育事业的发展并对教育有浓厚的兴趣。" +
                    "\n培养具有广泛人文、社会科学基本知识、扎实的教育学科、心理学科基础知识和牢固的教育学专业知识，具有较强的教育科研、教学、管理、咨询和辅导能力，能在各级各类师范院校、教育行政部门、科研机构及各级各类中小学校从事教学、科研、管理、咨询和辅导等方面工作的应用性人才。" +
                    "\n毕业生应获得以下几方面的知识和能力：\n" +
                    "1．掌握教育学科的基本理论和基本知识\n" +
                    "2．掌握教育科学研究的基本方法；\n" +
                    "3．具有从事教育专业教学和其它一两门中小学学科教学工作的能力；\n" +
                    "4．熟悉我国的教育方针、政策和法规；\n" +
                    "5．了解教育科学的理论前沿、教育改革的实际状况和发展趋势；\n" +
                    "6．掌握文献检索、资料查询的基本方法，具有一定的科学研究和实际工作能力。",
            "学前教育专业培养具备学前教育专业知识，能在托幼机构从事保教和研究工作的教师学前教育行政人员以及其他有关机构的教学、研究人才。" +
                    "\n毕业生应获得以下几方面的知识和能力：\n" +
                    "1．掌握学前教育学、幼儿心理学、幼儿园课程的设计与实施、幼儿教育研究方法等学科的基本理论和基本知识；\n" +
                    "2．掌握观察幼儿、分析幼儿的基本能力以及对幼儿实施保育和教育的技能；\n" +
                    "3．具有编制具体教育方案和实施方案的初步能力；\n" +
                    "4．熟悉国家和地方幼儿教育的方针、政策和法规；\n" +
                    "5．了解学前教育理论的发展动态；\n" +
                    "6．掌握文献检索、资料查询的基本方法，具有初步的科学研究和实际工作能力。",
            "教育技术学专业培养能够在新技术教育领域从事教学媒体和教学系统的设计、开发、运用、管理和评价等的教育技术学科高级专门人才，包括各级师范院校和中等学校教育技术学课程教师以及各级电教馆、高校和普教的教育技术人员。" +
                    "\n该专业学生主要学习教育技术学方面的基本理论和基本知识，接受学习资源和学习过程的设计、开发、运用、管理和评价等方面的基本训练，掌握新技术教育应用方面的基本能力。" +
                    "\n根据不同高校招收教育技术学专业时招录的生源文理科情况不同，每个高校培养目标也不一样，大致培养就业方向可以分为以下几个方面：\n" +
                    "1.在新技术教育领域从事教学媒体和教学系统的设计、开发、运用、管理和评价等相关领域工作，各级电教馆、高校和普教的教育技术人员各省市、区县电教馆（站）主要从事电教管理、课题研究、教育信息化建设（\"校校通\"工程、信息技术教育等等）相关工作；\n" +
                    "2．师范类与非师范类的学校教育技术系从事教育教学和研究管理工作；\n" +
                    "3．部委机关、部队、厂矿企业、外资企业的宣传部、教育部门，特别是企业职工培训工作是一个新的工作热点；\n" +
                    "4．中小学校、教育机构、职业技术学校等主要是电教管理、课件制作、信息技术教育课等；\n" +
                    "5．各级各类电视台、广播电台站、视频网络公司、教育机构，从事教育节目制作与摄影摄像工作；\n" +
                    "6．软件工程方向 就业前景十分广阔，学生毕业后可以从事教育软件的设计和开发工作；到国内外众多软件企业、国家机关以及各个大、中型企、事业单位的信息技术部门、教育部门等单位从事软件工程领域的技术开发、教学、科研及管理等工作。\n" +
                    "7．网络工程方向就业前景良好，学生毕业后可以从事远程教育、校园网（包括中小企业单位的网站）的资源设计、开发和管理工作；到国内外大型电信服务商、大型通信设备制造企业进行技术开发工作，也可以到其他企事业单位从事网络工程领域的设计、维护、教育培训等工作。\n" +
                    "8．广告公司、影视公司、电视台、影视后期公司、各类制造业、服务业等各类企业从事影视特效工作。制片厂、电视剧制作中心等各类事业单位从事影片特效、影片剪辑、摄影摄像、记者等工作。\n" +
                    "9．网络教育机构、在线学习机构、教学设计师、移动学习资源开发师、e-learning资源开发与管理等等。\n" +
                    "10．从事教育软件的设计和开发工作；出版社编辑、多媒体设计、平面设计，动画制作公司从事二维动画，三维动画制作等工作。\n" +
                    "11． 从事教育学、心理学研究及相关工作。\n" +
                    "12. 各类中小学从事通用技术教师或者各类职业技术从事教育教学和管理工作。",
            "体育教育专业主要培养适应我国社会主义现代化建设和基础教育改革与发展的实际需要，德、智、体、美全面发展，专业基础宽厚，具有现代教育观念、良好的科学素养和职业道德以及具有创新精神和实践能力的复合型人才为目的。" +
                    "\n体育教育专业培养具备系统地掌握体育教育的基本理论、基本知识和基本技能，掌握学校体育教育工作规律，具有较强的实践能力，在全面发展的基础上有所专长，能在中等学校等从事体育教学、课外体育活动、课余体育训练和竞赛工作，并能从事学校体育科学研究、学校体育管理、社会体育指导等工作的高级专门人才。\n" +
                    "学生主要学习教育学、心理学、人体科学、学校体育学、体育锻炼、训练与竞赛等方面的基本理论、基本知识和基本技能，受到体育科学研究的基本训练，掌握从事学校体育教育工作的基本能力。",
            "运动人体科学学科为国家级重点学科，培养从事体育科技教练、运动营养与运动伤害防护师、体育科学研究人员，全民健身指导及研究人员、运动人体科学专业的师资以及其他相关专业技术工作的专门人才。" +
                    "\n运动人体科学专业培养具备运动人体科学理论和实验研究能力，能在中等以上学校、体育科研机构、运动训练基地和保健康复等部门，从事运动人体科学方面的教学、科研、竞技运动和康复指导的高级专门人才。\n" +
                    "学生主要学习运动人体科学方面的基本理论和基本知识，受到专业实验技能方面的基本训练，掌握教学和科学研究方面的基本能力。",
            "社会体育专业学生主要学习社会体育方面的基础理论和基本知识，受到从事社会体育工作的基本训练，掌握群众体育活动组织管理、咨询指导、经营开发和教学科研等方面的基本能力。" +
                    "\n社会体育专业学生主要学习社会体育方面的基础理论和基本知识，受到从事社会体育工作的基本训练，掌握群众体育活动组织管理、咨询指导、经营开发和教学科研等方面的基本能力。\n" +
                    "通过学习，将具备了以下几方面的能力：\n" +
                    "1．掌握社会体育相关学科的基本理论、基本知识；\n" +
                    "2．掌握指导大众体育、养生健身、休闲娱乐及特殊人群体育的运动技术；\n" +
                    "3．具有从事群众性体育活动的组织管理、咨询指导、经营开发及教学等方面的基本能力；\n" +
                    "4．熟悉党和国家有关体育事业的方针、政策、法规；\n" +
                    "5．了解国内外在社会体育方面的学术发展动态；\n" +
                    "6．掌握文献检索、资料查询的基本方法，具有一定的科学研究和实际工作能力。"
    };

    //文学 15
    public static String[] wenxueMajorNames = new String[]{
            "汉语言文学","应用语言学","新闻学","广告学","传播学","编辑出版学","媒体创意","英语","俄语","法语","日语","阿拉伯语","马来语","葡萄牙语","意大利语"
    };
    public static int[] wenxueMajorClass = new int[]{4,4,4,4,4,4,4,4,4,4,4,4,4,4,4};
    public static String[] wenxueMajorcodes = new String[]{
            "050101","050107W","050301","050303","050305W","050305","050306W","C050207","050202","050204","050207","050206"," 050217J","050231","050237"
    };
    public static String[] wenxueMajorAbstracts = new String[]{
            "汉语言文学专业主要培养掌握汉语和中国文学方面的基本知识，受到有关理论、发展历史、研究现状等方面的系统教育和业务能力的基本训练，可在科研机关、高等院校从事研究、教学工作、有的可从事对外汉语教学，可适宜在党政机关，包括报刊宣传、新闻出版、影视文化、互联网、对外交流其他企事业部门从事语言文字工作的专门人才。" +
                    "\n知识技能：\n" +
                    "1．掌握马克思主义的基本原理和关于语言、文学的基本理论；\n" +
                    "2．掌握该专业的基础知识以及新闻、历史、哲学、艺术等学科的相关知识；\n" +
                    "3．具有文学修养和鉴赏能力以及较强的写作能力；\n" +
                    "4．了解我国关于语言文字和文学艺术的方针、政策和法规；\n" +
                    "5．了解本学科的前沿成就和发展前景；\n" +
                    "6．能阅读古典文献，掌握文献检索、资料查询的基本方法，具有一定的科学研究和实际工作能力。",
            "应用语言学（applied linguistics）研究语言在各个领域中实际应用的语言学分支。它着重解决现实当中的实际问题，一般不接触语言的历史状态，也不大介入一般理论上的争辩。可以说，它是鉴定各种理论的实验场。\n" +
                    "用语言学专业培养具备文艺理论素养和系统的汉语言文学知识，能在新闻文艺出版部门、高校、科研机构和机关企事业单位从事文学评论、汉语言文学教学与研究工作，以及文化、宣传方面的实际工作的汉语言文学高级专门人才" +
                    "\n主要课程：\n" +
                    "语言理论，语言研究方法，应用语言学，对外汉语教学概论，语法理论，语义理论，词汇理论，实验语音学，汉语语用学，汉语方言与方言调查，语言与文化，跨文化交际等。",
            "新闻学专业培养的是具备系统的新闻理论知识与技能、宽广的文化与科学知识，熟悉我国新闻、宣传政策法规，能在新闻、出版与宣传部门从事编辑、记者与管理等工作的新闻学高级专门人才。" +
                    "\n新闻学是研究人类社会各类新闻传播活动的形成、发展和基本规律的应用性社会科学。在全球化经济发展和信息社会形成的过程中，以新闻传媒为核心的新闻传播事业将发挥巨大的作用。面对国际性跨国媒介集团的竞争，我国高水平新闻人才的培养刻不容缓。本系坚持贯彻党和国家的教育方针，立足全国、面向世界，为我国现代新闻传播事业和现代文化事业的繁荣与发展培养具有国际竞争能力和水平的优秀人才。由于本学科具有较强的应用性，所以本系特别注重通过组织学生开展大型新闻实践活动彰显该系教学的实践性品格。" +
                    "\n该专业学生主要学习马克思主义基本原理和新闻学基本理论和基础知识，受到新闻业务的基本训练，具有社会活动和科研的基本能力。",
            "广告学专业培养具备广告学理论与技能、宽广的文化与科学知识，能在新闻媒介广告部门、广告公司、市场调查及信息咨询行业以及企事业单位从事广告经营管理、广告策划创意和设计制作、市场营销策划及市场调查分析工作的广告学高级专门人才。" +
                    "\n广告学是一门独立的学科，它是研究广告活动的历史、理论、策略、制作与经营管理的科学。有关广告的知识，起初只零星地见之于新闻学科和经济学科的部分章节内，且很不成系统。广告知识是这些学科的组成内容之一，如新闻学、市场学、企业管理学、商业心理学等都论述到广告的内容。" +
                    "\n（1）掌握广告学的基本知识和基本理论；\n" +
                    "（2）掌握现代广告的策划、创意、制作、发布的基本知识、具有市场调查与营销的基本知识和进行市场分析的基本能力，能从事经济贸易广告的设计和制作；\n" +
                    "（3）熟悉有关广告的政策法规；\n" +
                    "（4）具有公共关系的基本知识和一定的公关能力；\n" +
                    "（5）了解有关社会科学、人文科学、管理科学、自然科学与技术科学的基本知识；\n" +
                    "（6）具有自学能力，及时了解中国广告和国外广告事业的发展动态；\n" +
                    "（7）掌握一门外语，达到国家四级水平；\n" +
                    "（8）具有系统运用计算机的能力；\n" +
                    "（9）掌握科学锻炼身体的方法，达到国家大学生体育合格标准。",
            "传播学专业具有鲜明特色，特别是在农业科教影视领域具有独到的优势。为了适应21世纪信息社会和知识经济时代要求，本专业还设置了影视传播和传播理论与实务两个专业方向，学生可以根据自身的特点和兴趣选择相关专业方向深入学习。本专业培养有宽厚人文社会科学和自然科学基础，掌握传播专业基本理论和技能，具有较强的国际交流和使用现代传媒技术能力，富于创新精神和高度社会责任感的高素质专业人才。" +
                    "\n本专业培养具备现代媒体传播的基础理论和知识，适应信息化社会与知识经济时代的要求，掌握现代电子媒体，特别是电视媒体与网络多媒体传播的基本技能，有志从事影视传播、新闻传播、网络传播、广告及媒介经营管理的高素质专门人才。" +
                    "\n通过学习，可以具备以下几方面的能力：\n" +
                    "1、掌握传播学基本理论与基本知识。\n" +
                    "2、掌握广播电视节目策划、广告企划制作、公关活动策划与执行、媒体运营、新闻采访、写作、编辑、摄影等业务知识与技能。\n" +
                    "3、有调查研究和社会活动能力。\n" +
                    "4、了解中外传播媒体工作现状与发展趋势。",
            "编辑出版学专业培养具备系统的编辑出版理论知识与技能、宽广的文化与科学知识，能在书刊出版、新闻宣传和文化教育部门从事编辑、出版、发行的业务与管理工作以及教学科研的编辑出版学高级专门人才。" +
                    "\n该专业学生主要学习编辑学、出版与发行学的基本知识，受到编辑与出版的基本技能训练，具有社会活动和科研的基本能力。" +
                    "\n毕业生应获得以下几方面的知识和能力：\n" +
                    "1．掌握编辑与出版的基本理论与基本知识；\n" +
                    "2．掌握市场分析、选题策划、文字加工、宣传促销的知识与方法；\n" +
                    "3．具有较强的口头表达和文字表达能力和初步从事科学研究的能力；\n" +
                    "4．了解我国有关编辑与出版市场营销的方针、政策、法规；\n" +
                    "5．了解有关社会科学、人文科学、管理科学、自然科学与技术科学基本知识。",
            "媒体创意专业是适应创意时代需要而创办的一个新型、特色专业，它抓住了创意时代大众传媒的本质，适应了市场经济条件下传媒竞争与发展的需要，是一个有时代感、有活力的专业。可以说，它有效地利用、整合了中国传媒大学的资源优势——如良好的教育基础和丰厚的业界资源，体现了中国传媒大学的办学特色。在校方领导的支持下，经过几年来的群策群力，目前该专业已基本创意成型。" +
                    "\n本专业主要为广播电视机构、报刊杂志社、出版和宣传部门、网络公司、广告公司、影视制作公司以及企业事业单位等相关部门培养能适应现代社会进步与文化事业发展需要、熟悉各类媒体特性、具有创造性思维和媒体创新能力的，从事品牌策划、创意、广告宣传等工作的复合型高级专业人才。目前大陆开设此专业的院校有中国传媒大学、湖南大学、中国传媒大学南广学院、浙江传媒学院、上海戏剧学院、四川传媒学院、广西艺术学院、厦门理工学院、三明学院海峡动漫学院。" +
                    "\n本专业是应传媒事业发展需要而创办的一个带有交叉、综合特色的艺术类专业，旨在培养现代传媒所需要的专业的媒体“创意人”。",
            "英语专业培养具有扎实的英语语言基础和比较广泛的科学文化知识，能在外事、经贸、文化、新闻出版、教育、科研、旅游等部门从事翻译、研究、教学、管理工作的英语高级专门人才。" +
                    "\n英语专业学生主要学习英语语言、文学，英美等英语国家历史、政治、经济、外交、社会文化等方面基本理论和基本知识，受到英语听、说、读、写、译等方面的良好的技巧训练，掌握一定的科研方法，具有从事翻译、研究、教学、管理工作的业务水平及较好的素质与能力。",
            "俄语专业培养的目标是使学生在大学本科阶段掌握扎实的俄语语言基础知识和语言基本技能，熟练的俄语语言运用能力，并且通过教育理论课程和教育实习环节形成良好的教师素养，使学生获得从事俄语教学的基本能力和俄语教育研究的基本能力。" +
                    "\n该专业学生主要学习俄语语言基础知识，受到俄语听、说、读、写、译等方面的语言基本技能训练，能够较熟练的使用计算机进行俄语及汉语的文字处理，通过教育理论课程和教育实习环节形成良好的教师素养，获得从事俄语教学的基本能力和俄语教育研究的基本能力。" +
                    "\n就业前景分析 (按俄语专业相关职位统计) 据统计，俄语专业就业前景最好的地区是：北京。在\"外国语言文学类\"中排名第 6。",
            "法语专业培养具有扎实的相应语语言基础比较广泛的科学文化知识，能在外事、经贸、文化、新闻出版、教育、科研、旅游等部门从事翻译、研究、教学、管理工作的相应语言高级专门人才。" +
                    "\n该专业学生主要学习相应语语言、文学、历史、政治、经济、外交、社会文化等方面的基本理论和基本知识，受到相应语听、说、读、写、译等方面的良好的熟巧训练，掌握一定的科研方法，具有从事翻译、研究、教学、管理工作的业务水平及较好的素质和较强的能力。" +
                    "\n法语专业学生毕业后可在外事、经贸、文化、新闻出版、教育、科研、旅游等部门从事翻译、研究、教学、管理工作。",
            "日语专业培养具有扎实的相应语言基础比较广泛的科学文化知识，能在外事、经贸、文化、新闻出版、教育、科研、旅游等部门从事翻译、研究、教学、管理工作的相应语言高级专门人才。" +
                    "\n该专业学生主要学习相应语语言、文学、历史、政治、经济、外交、社会文化等方面的基本理论和基本知识，受到相应语听、说、读、写、译等方面的良好的熟巧训练，掌握一定的科研方法，具有从事翻译、研究、教学、管理工作的业务水平及较好的素质和较强的能力。"
                    ,
            "阿拉伯语专业培养具有扎实的相应语语言基础比较广泛的科学文化知识，能在外事、经贸、文化、新闻出版、教育、科研、旅游等部门从事翻译、研究、教学、管理工作的相应语言高级专门人才。" +
                    "\n该专业学生主要学习相应语语言、文学、历史、政治、经济、外交、社会文化等方面的基本理论和基本知识，受到相应语听、说、读、写、译等方面的良好的训练，掌握一定的科研方法，具有从事翻译、研究、教学、管理工作的业务水平及较好的素质和较强的能力。" +
                    "\n毕业生应获得以下几方面的知识和能力：\n" +
                    "1.了解我国有关的方针、政策、法规；\n" +
                    "2.掌握语言学、文学及相关人文和科技方面的基础知识；\n" +
                    "3.具有扎实的相应语言基础和较熟练的听、说、读、写、译能力；\n" +
                    "4.了解我国国情和相应国家的社会和文化；\n" +
                    "5.具有较好的汉语表达能力和基本调研能力；\n" +
                    "6.具有第二外国语的一定的实际应用能力；\n" +
                    "7.掌握文献检索、资料查询的基本方法，具有初步科学研究和实际工作能力。",
            "马来语专业培养具有扎实的相应语语言基础比较广泛的科学文化知识，能在外事、经贸、文化、新闻出版、教育、科研、旅游等部门从事翻译、研究、教学、管理工作的德才兼备的马来语高级专门人才。" +
                    "\n该专业学生主要学习马来语语言、马来语文学、文化、历史、政治、经济、国情、东南亚历史与文化等方面的基本理论和基本知识，受到马来语听、说、读、写、译等技能的良好训练，掌握一定的科研方法，具有较强的从事翻译、研究、 教学、管理工作的能力。" +
                    "\n毕业生适应的工作范围：各外事部门的翻译工作、各研究单位有关语言、文学、历史、文化等方面研究工作以及有关学校马来语言、文化或其他有关课程的教学工作。",
            "葡萄牙语专业培养具有扎实的葡萄牙语言基础比较广泛的科学文化知识，能在外事、经贸、文化、新闻出版、教育、科研、旅游等部门从事翻译、研究、教学、管理工作的相应语言高级专门人才。" +
                    "\n该专业学生主要学习葡萄牙语语言、文学、历史、政治、经济、外交、社会文化等方面的基本理论和基本知识，受到葡萄牙语听、说、读、写、译等方面的良好的训练，掌握一定的科研方法，具有从事翻译、研究、教学、管理工作的业务水平及较好的素质和较强的能力。" +
                    "\n葡语专业就业范围广，就业层次及薪酬待遇也较高。学生毕业后主要有如下去向：\n" +
                    "国家部委：外交部、中联部、商务部等。\n" +
                    "事业单位：新华社、中国国际广播电台、外文局等。\n" +
                    "外资企业、国有企业、中外合资企业：很多来校招聘的企业属于世界500强企业，主要经营项目包括国际承包工程、国际工程咨询、国际劳务合作、国际贸易、国家文化交流、电子信息产品贸易等。毕业生进入公司初期一般从事翻译、业务等方面的工作，有大量出国机会。很多企业在基础设施建设、商务贸易等方面，与安哥拉、巴西等葡语国家交往密切。\n" +
                    "除此之外，葡萄牙语专业毕业生的就业去向还包括旅行社、银行等。",
            "意大利语专业培养具有扎实的意大利语语言基础和比较广泛的科学文化知识，能在外事、经贸、文化、新闻出版、教育、科研、旅游等部门从事翻译、研究、教学、管理工作的意大利语高级专门人才。" +
                    "\n本专业学生主要学习意大利语语言、文学、历史、政治、经济、外交、社会文化等方面的基本理论和基本知识，受到意大利语听、说、读、写、译等方面良好的熟巧训练，掌握一定的科研方法，具有从事翻译、研究、教学、管理工作的业务水平及较好的素质和较强能力。" +
                    "\n毕业生适宜在外交、外贸、旅游、对外文化交流机构、研究和教育等部门从事口译、笔译或科研、教学工作。"
    };

    //历史学 4
    public static String[] lishixueMajorNames = new String[]{
            "历史学","世界历史","考古学","文物保护技术"
    };
    public static int[] lishixueMajorClass = new int[]{5,5,5,5};
    public static String[] lishixueMajorcodes = new String[]{
            "060101","060102","060103","060105T"
    };
    public static String[] lishixueMajorAbstracts = new String[]{
            "历史学专业培养具有一定的马克思主义基本理论素养和系统的专业基本知识，有进一步培养潜能的史学专门人才，以及能在国家机关、文教事业、新闻出版、文博档案及各类介事业单位从事实际工作的应用型、复合型高级专门人才。" +
                    "\n该专业学生主要学习历史科学的基本理论和基本知识，受到中国历史和世界历史发展的基本史实及史学研究的基本训练，具有从事专业工作所需的基本能力。" +
                    "\n就业方向：\n科研单位，党政机关，新闻出版部门，学校，文化型企业等行业",
            "世界史专业除常规教学环节外，本专业适当安排了一些专题讲座、学术报告、学生辩论、演讲比赛、各项体育比赛等活动，以提高学生综合素质和实际能力。" +
                    "\n本专业培养具有一定的马克思主义基本理论素养和系统的专业基本知识，有进一步培养潜能的史学专门人才，以及能在国家机关、文教事业、新闻出版、文博档案及各类事业单位从事实际工作的应用型、复合型高级专门人才。" +
                    "\n主要课程：世界通史、中国通史、世界文明史、史学概论、西方史学史、中国史学史、历史地理学，古代汉语、专业外语、中外历史文献以及史学名著选读等。",
            "考古学是历史科学的重要组成部分，属于人文学科。简单地说，考古学就是根据古代人类遗留下来的实物，研究古代社会历史的科学。这些实物资料包括各种遗迹和遗物，多埋藏在地下。通过发掘、鉴定、分类等复杂的工作，这些实物资料才能得以系统、完整地收集起来。因此，考古学研究的基本方法就是田野调查和发掘。" +
                    "\n考古学专业培养具备考古学基础知识与基本技能，有进一步培养潜能的高层次专门人才和能在考古、文物、博物馆等事业单位及国家机关从事研究、教学、管理等实际工作的考古学高级专门人才。" +
                    "\n学生主要学习考古学的基本理论、方法与技能，了解考古学的多学科交叉发展趋势和世界考古学发展概况，熟悉中国考古学的发展历史、研究现状；在中国历史、世界历史、博物馆学、文物学理论、文化人类学、民族学、古代汉语、史料学、地理学、第四纪环境学、古人类学等方面受到基本训练。",
            "文物保护技术专业是我国高等学校中最早设立的文物保护本科专业。该专业教育的特点是文、理科交叉与理、工科渗透，现代科学技术与人文科学知识相结合；既掌握数理化等学科的基本知识和历史、文物考古的一般知识，又掌握文物保护材料应用、文物材质分析和文物保护修复等实际操作技能。培养能在文物考古、博物馆、文物管理机构从事文物保护与科学研究工作的专门人才。" +
                    "\n就业前景：可到文化、文物、博物、环保、建设、公安、海关、旅游及科研、高校等部门，从事教育、科研、设计、开发、管理等工作。"
    };

    //理学  16
    public static String[] lixueMajorNames = new String[]{
            "数学与应用数学","物理学","应用物理学","化学","应用化学","化学生物学","生物科学","生物信息技术","天文学","地质学","地理信息系统","地球物理学","应用气象学","军事海洋学","心理学","统计学"
    };
    public static int[] lixueMajorClass = new int[]{6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6};
    public static String[] lixueMajorcodes = new String[]{
            "070101","070201","070202","070301","070302","070303T","071001","070404","070401","070901","070503","070801","070602","070704T","071101","071201"
    };
    public static String[] lixueMajorAbstracts = new String[]{
            "数学与应用数学专业培养掌握数学科学的基本理论与基本方法，具备运用数学知识、使用计算机解决实际问题的能力，受到科学研究的初步训练，能在科技、教育和经济部门从事研究、教学工作或在生产经营及管理部门从事实际应用、开发研究和管理工作的高级专门人才。" +
                    "\n数学与应用数学专业属于基础专业。无论是进行科研数据分析、软件开发，还是从事金融保险，国际经济与贸易、化工制药、通讯工程、建筑设计等，都离不开相关的数学知识。可见数学与应用数学专业是从事其他相关专业的基础。随着科技事业的发展和普及，数学专业与其他相关专业的联系将会更加紧密，数学知识将会得到更广泛的应用。" +
                    "\n数学与应用数学是计算机专业的基础和上升的平台，是与计算机科学与技术联系最为紧密的专业之一。\n" +
                    "该专业属于基础型专业，就业面较宽，不过考研仍然是该专业毕业生的首选。\n" +
                    "在日常生活中，从天气预报到股票涨落，到处充斥着数学的描述和分析方法。北京市需求毕业生人数最多的十大专业中，数学与应用数学专业需求量位居前列。分析上述资料不难看出，数学人才的需求量较大，就业前景看好。而且可以预见，随着经济和社会的发展，市场对数学与应用数学专业人才的需求将会越来越多，其就业前景比较广阔。\n" +
                    "合格的软件人才，需要有“扎实的数学功底”，“严密的逻辑思维能力”。",
            "物理学专业培养掌握物理学的基本理论与方法，具有良好的数学基础和实验技能，能在物理学或相关的科学技术领域中从事科研、教学、技术和相关的管理工作的高级专门人才。" +
                    "\n该专业学生主要学习物质运动的基本规律，接受运用物理知识和方法进行科学研究和技术开发训练，获得基础研究或应用基础研究的初步训练，具备良好的科学素养和一定的科学研究与应用开发能力。" +
                    "\n该专业的学生毕业后可到高校从事教学工作，或是到研究所从事理论研究、实验研究和技术开发与应用工作；另外还可以到企业中从事材料科学与工程、电子信息技术等领域的技术开发及应用研究工作。",
            "应用物理学专业培养具有坚实的数理基础，熟悉物理学基本理论和发展趋势，熟悉计算机语言，掌握实验物理基本技能和数据处理的方法，获得技术开发以及工程技术方面的基本训练，具有良好的科学素养和创新意识的人才。" +
                    "\n该专业学生主要学习物理学的基本理论与方法，具有良好的数学基础和实验技能，受到应用基础研究、应用研究和技术开发以及工程技术的初步训练，具有良好的科学素养，适应高新技术发展的需要，具有较强的知识更新能力和较广泛的科学适应能力。" +
                    "\n主要必修课程：高等数学（或数学分析）、线性代数（或高等代数）、概率论与数理统计、普通物理学(包括力学、热学、光学、电磁学、原子物理学)、理论物理类(包括理论力学、电动力学、热力学与统计力学、量子力学)、数学物理方法、电子技术(包括模拟电子技术、数字电子技术)、固体物理学、普通物理实验、近代物理实验、激光物理、C语言，等。" +
                    "\n就业去向：毕业生能在应用物理、电子信息技术、材料科学与工程、计算机技术等相关科学领域从事应用研究、技术开发以及教学和管理工作。",
            "化学专业培养具备化学的基础知识、基本理论和基本技能，能在化学及与化学相关的科学技术和其它领域从事科研、教学技术及相关管理工作的高级专门人才。" +
                    "\n该专业学生主要学习化学方面的基本知识、基本理论和基本技能与方法，受到科学思维和科学实验的训练，具有一定的科学研究、应用研究及科技管理的能力。" +
                    "\n主干课程:无机化学、分析化学（含仪器分析）、有机化学、物理化学（含结构化学）、化学工程基础等。",
            "应用化学是一级学科化学工程与技术下设的二级学科。该专业培养具备化学的基本理论、基本知识且具有较强的实验技能，能在科研机构、高等学校及企事业单位等从事科学研究、教学工作及管理工作的高级专门人才。" +
                    "\n该专业学生主要学习化学方面的基础知识、基本理论、基本技能以及相关的工程技术知识，受到基础研究和应用基础研究方面的科学思维和科学实验训练，具有较好的科学素养，具备运用所学知识和实验技能进行应用研究、技术开发和科技管理的基本技能。" +
                    "\n应用化学专业的毕业生一次性就业率比较高，就业行业包括教育、材料、军工、汽车、军队、电子、信息、环保、市政、建筑、建材、消防、化工、机械等行业。部门包括：各级质量监督与检测部门、科研院所、设计院所、教学单位、生产企业、省级以上的消防总队等。该专业毕业生适宜到石油化工、环保、商品检验、卫生防疫、海关、医药、精细化工厂等生产、技术、行政部门和厂矿企业从事应用研究、科技开发、生产技术和管理工作；也适宜到科研部门和学校从事科学研究和教学工作。",
            "化学生物学专业培养学习化学与生物科学的基本理论、基本知识和实验、应用技能，受到基础研究和应用基础研究方面的科学思维和科学实验训练，具备应用研究、技术开发和科技管理的基本技能的高级专门人才。" +
                    "\n化学生物学是研究生命过程中化学基础的科学。疾病的发生发展是致病因子对生命过程的干扰和破坏；药物的防治是对病理过程的干预。化学生物学通过用化学的理论和方法研究生命现象、生命过程的化学基础，通过探索干预和调整疾病发生发展的途径和机理，为新药发现中提供必不可少的理论依据。" +
                    "\n该专业的就业前景相当广泛，学生毕业后适宜到科研部门、高等学校从事研究工作和教学工作；适宜到化学、药学、医疗、生化制药、生物工程、无机新材料、化工、轻工、能源等行业，以及厂矿企业、事业、技术和行政部门从事应用研究、科技开发和管理工作。",
            "生物科学（又称生命科学）专业包括了生物科学和生物技术两个专业方向，这些专业学科主要培养学生学习生物科学技术方面的基本理论、基本知识，学生将受到应用基础研究和技术开发方面的科学思维和科学实验训练，进而具有较好的科学素养及初步的教学、研究、开发与管理的基本能力。其核心课程主要包括了动物生物学、植物生物学、微生物学、生物化学、遗传学、细胞生物学、分子生物学、普通生态学等学科；必修课程则包括无机及分析化学、有机化学、大学数学、大学物理学、生物统计学、发育生物学、生物技术概论、进化生物学等。" +
                    "\n生物科学专业培养具备生物科学的基本理论、基本知识和较强的实验技能，能在科研机构、高等学校及企事业单位等从事科学研究、教学工作及管理工作的生物科学高级专门人才。" +
                    "\n学生主要学习生物科学方面的基本理论、基本知识，受到基础研究和应用基础研究方面的科学思维和科学实验训练，具有较好的科学素养及一定的教学、科研能力。",
            "属于理学，生物科学，主要课程包括动物生物学、植物生物学、微生物学、基础生物化学、生物信息学、遗传学、数据库、计算机操作系统、生物统计学、分子生物学、发育生物学及计算机模拟、生物芯片技术、神经生物学、基因工程、软件工程、信息论、计算机图形学等。" +
                    "\n要求学生具有计算机技术背景，通晓分子生物学知识，熟练运用生物信息处理软件的生物学～计算机两栖复合应用型的基本理论、基本知识和基本技能。",
            "天文学专业培养具备良好的数学、物理和天文等方面的基本知识和基本能力，能在天文学及相关学科从事科研、教学和技术工作的高级专业人才。" +
                    "\n天文学可分为天体测量学、天体动力学、天体物理学三大领域，这三大领域如今备受人们的关注。" +
                    "\n该专业学生主要学习天文、物理和数学等方面的基本理论和基本知识，受到天文观测方面的科学思维和基础训练，具有良好的科学素养，掌握理论分析、数据处理和计算机应用的基本技能。" +
                    "\n主干课程:大学数学、大学物理、理论力学、数学物理方法、电动力学、普通天文学、实体天体物理、恒星物理基础、计算天文学入门等。",
            "地质学专业培养具备地质学基本理论、基本知识、基本技能和相关学科基础知识，具有较好的科学素养及初步的研究、教学和管理能力，能在科研机构、学校从事地质科学研究或教学工作，在地矿、冶金、建材、石油、煤炭、材料、环境、基础工程、旅游开发从事技术开发与技术管理工作以及在行政部门从事管理工作的高级专门人才。" +
                    "\n地质学专业比较适合能吃苦、对地质学类专业感兴趣、适宜野外作业的考生报考。" +
                    "\n该专业学生主要学习地质学方面的基本理论和基本知识，受到基础研究和应用基础研究方面的科学思维和科学实践训练，掌握地质调查、科学研究、资源开发和管理的基本技能。" +
                    "\n地质学专业的学生毕业后不仅可在高等院校从事地质科学的教学工作，也可以向国家资源能源勘探、开发与环保、城市建设、城市交通、港口、水利水电建设、国防和地质灾害监测与防治等机构从事研究工作。",
            "地理信息系统（简称GIS）是近20年来新兴的一门集地理学、计算机、遥感技术和地图学于一体的边缘学科，主要培养具备地理信息系统与地图学、遥感技术方面的基本理论、基本知识、基本技能，能在科研机构或高等学校从事科学研究或教学工作，能在城市、区域、资源、环境、交通、人口、住房、土地、灾害、基础设施和规划管理等领域的政府部门、金融机构、公司、高校、规划设计院所，从事与地理信息系统有关的应用研究、技术开发、生产管理和行政管理等工作的高级专门人才。" +
                    "\n作为大学教育的一个专业，地理信息系统在20世纪70年代开始出现在国外的许多大学，而我国只有不到140所高校开设有该专业，所以从事地理信息系统设计开发的高级人才已经呈现供不应求的局面。而且，随着国家各个部门信息化的进程，以及国内从事地理信息系统工程开发的高科技企业的增多和发展状大，对该专业人才的需求还将增大，缺口也将扩大。" +
                    "\n毕业生可在与城市、区域、资源、环境、交通、人口、住房、土地、基础设施和规划管理等领域的相关部门从事与地理信息系统有关的应用研究、技术开发、生产管理和行政管理等工作，也可在科研机构或高等学校从事科学研究或教学工作。",
            "地球物理学专业培养具备坚实的数理基础和较系统的地球物理学基本理论、基本知识和基本技能，受到基础研究和应用基础研究的基本训练，具有较好的科学素养及初步的教学、研究能力，能在科研机构、高等学校或相关的技术和行政部门从事科研、教学、技术开发和管理工作的高级专门人才。" +
                    "\n地球物理学专业学生主要学习地球物理学方面的基本理论和基本知识，受到基础研究和应用基础研究方面的科学思维和科学实验训练，掌握地球深部构造、地震预测、地球物理工程、能源及矿产资源勘察等研究与开发的基本技能。" +
                    "\n主干学科：地质学、物理学、数学、计算机\n" +
                    "主要课程：地球物理学(地震学、重力学、地磁学、地电学)、地球物理观测、地质学、连续介质力学、计算机及信息处理等。",
            "应用气象学专业旨在培养掌握应用气象学专业的基础知识、基本理论和基本技能，能够在农业气象及生态环境监测调控、信息分析处理、资源开发利用和防灾减灾等科研、教学和业务部门工作的应用性高级专门人才。学生接受应用气象学基本理论和基础知识的学习，掌握气象信息服务系统研制与运用、气候资源开发与利用、产业工程的适用气象技术研究、气象防灾减灾对策与技术研究，生态环境调控以及解决气象学在有关领域中应用问题方面的基本能力。" +
                    "\n应用气象学专业培养掌握应用气象学专业的基础知识、基本理论和基本技能，能够在农业气象及生态环境监测调控、信息分析处理、资源开发利用和防灾减灾等科研、教学和业务部门工作的应用性高级专门人才。\n" +
                    "学生主要学习应用气象学基本理论和基础知识，受到科学思维、科学实验、信息处理技术等方面的技术和基础训练，具有良好的科学素养和坚实的大气科学、生物科学和环境科学等方面的基础，掌握气象信息服务系统研制与运用、气候资源开发与利用、产业工程的实用气象技术研究、气象防灾减灾对策与技术研究、生态环境调控以及解决气象学在有关领域中应用问题等方面的基本能力。具有较强的知识更新能力和较广泛的科学适应能力。",
            "军事海洋学专业是适应国家军事海洋学人才需求而设置的特色新专业，本专业主要是课堂理论讲授和实习演练相结合的方式进行教学。是研究和利用海洋自然规律，为海上军事行动提供科学依据和实施海洋保障的科学，是在海洋科学和军事科学基础上结合发展起来的研究领域。" +
                    "军事海洋学专业学生通过学生海洋科学、军事科学等方面基本理论和基本知识的学习，并受到海洋科学、军事科学研究方面的基本训练，从而系统掌握海洋学调查研究、海洋工程技术、海洋环境保障的基本方法和技能，具有海洋声学、深海研究、深潜技术以及反潜战环境预报等的基本能力。" +
                    "主干课程:流体力学、海洋学、海洋物理学、军事海洋学、海浪预报理论及方法、海洋声学、海洋动力学、海洋天气学、海战战场海洋环境评估与预测、卫星遥感及海洋遥测、军事思想、军事运筹学、军事基层管理。",
            "心理学专业培养具备心理学的基本理论、基本知识、基本技能，能在科研部门、高等和中等学校、企事业单位等从事心理学科学研究、教学工作和管理工作的高级专门人才。" +
                    "\n该专业主要学习心理学方面的基本理论和基本知识，接受心理学科学思维和科学实验的基本训练，具有良好的科学素养和进行心理学实验和心理测量的基本能力。" +
                    "\n主要学科:心理学、生物学、计算机科学与技术、高等数学。",
            "统计学（statistics）是应用数学的一个分支，主要通过利用概率论建立数学模型，收集所观察系统的数据，进行量化分析、总结，做出推断和预测，为相关决策提供依据和参考。它被广泛的应用在各门学科之上，从物理和社会科学到人文科学，甚至被用来工商业及政府的情报决策之上。随着数字化的进程不断加快，人们越来越多地希望能够从大量的数据中总结出一些经验规律从来为后面的决策提供一些依据。统计学专业不是仅仅像其表面的文字表示，只是统计数字，而是包含了调查、收集、分析、预测等。应用的范围十分广泛。" +
                    "\n统计学专业主要包括一般统计和经济统计两类专业方向，培养具有良好的数学或数学与经济学素养，掌握统计学的基本理论和方法，能熟练地运用计算机分析数据，能在企业、事业单位和经济、管理部门从事统计调查、统计信息管理、数量分析等开发、应用和管理工作，或在科研、教育部门从事研究和教学工作的高级专门人才。" +
                    "\n统计学专业毕业生的主要就业流向有三大部分：政府部门（统计局等），银行、保险公司、证券公司等金融部门，市场调查公司、咨询公司、各公司的市场研究部门，工业企业的质量检测部门等企业事业单位。"
    };

    //工学  17
    public static String[] gongxueMajorNames = new String[]{
            "机械设计制造及其自动化","过程装备与控制工程","工业设计","测控技术及仪器","热能与动力工程","核工程与核技术","计算机科学与技术","通信工程","光电信息工程","生物医学工程","软件工程","建筑学","环境科学与工程","交通工程","船舶与海洋工程","航空航天工程","海事管理"
    };
    public static int[] gongxueMajorClass = new int[]{7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7};
    public static String[] gongxueMajorcodes = new String[]{
            "080301","080206","080205","080401","080501","082201","0812","080703","080616","0831","080902","082801","082501","0823","081901","082001","520404"
    };
    public static String[] gongxueMajorAbstracts = new String[]{
            "机械设计制造及其自动化专业培养具备机械设计制造基础知识与应用能力，能在工业主产第一线从事机械制造领域内的设计制造、科技开发、应用研究、运行管理和经营销售等方面工作的高级工程技术人才。" +
                    "\n该专业学生主要学习机械设计与制造的基础理论，学习微电子技术、计算机技术和信息处理技术的基本知识，受到现代机械工程师的基本训练，具有进行机械产品设计、制造及设备控制、生产组织管理的基本能力。" +
                    "\n毕业生应获得以下几方面的知识和能力：\n" +
                    "1. 具有较扎实的自然科学基础、较好的人文、艺术和社会科学基础及正确运用本国语言、文字的表达能力；\n" +
                    "2. 较系统地掌握该专业领域宽广的技术理论基础知识，主要包括力学、机械学、电工与电子技术、机械工程材料、机械设计工程学、机械制造基础、自动化基础、市场经济及企业管理等基础知识。\n" +
                    "3. 具有该专业必需的制图、计算、实验、测试、文献检索和基本工艺操作等基本技能；\n" +
                    "4. 具有该专业领域内某个专业方向所必要的专业知识，了解其科学前沿发展趋势；5. 具有初步的科学研究、科技开发及组织管理能力；\n" +
                    "6. 具有较强的自学能力和创新意识。",
            "过程装备与控制工程专业掌握控制科学与工程、化工原理及化工工艺等基础理论和知识，掌握工业生产过程检测与控制的专业知识，掌握仪器仪表开发与微型计算机应用的专业知识，培养从事工业生产过程检测与控制系统设计、智能仪器仪表设计、微计算机应用及其软件开发工作的高级工程技术人才。" +
                    "\n过程装备与控制工程专业培养具备化学工程、机械工程、控制工程和管理工程等方面的知识，能在化工、石油、能源、轻工、环保、医药、食品、机械及劳动安全等部门从事工程设计、技术开发、生产技术、经营管理以及工程科学研究等方面的高级工程技术人才。" +
                    "\n学生主要学习过程装备及控制工程专业的基础理论与技术和有关设备的设计方法，受到现代机械工程师的基本训练，具有从事各类机械设备设计、生产组织管理的基本能力。",
            "工业设计专业学生主要学习工业设计的基础理论与知识，具有应用造型设计原理和法则处理各种产品的造型与色彩、形式与外观、结构与功能、结构与材料、外形与工艺、产品与人、产品与环境、市场的关系，并将这些关系统一表现在产品的造型设计的基本能力。" +
                    "\n工业设计专业以工业产品造型设计为主要方向，并辅以视觉传达设计和环境设计，培养具备工业设计的基础理论、知识与应用创新能力，掌握工业设计的基本技能，进行工业产品造型的开发与设计、管理以及科学研究的应用型高级专门人才。" +
                    "\n课程体系\n" +
                    "专业学习主要内容：该专业设置产品设计、环境设施设计、视觉传达设计、数字化设计、展示与陈设设计5个专业选题方向，主要开设画法几何、阴影透视、工程制图、设计初步等基础课程，以及视觉传达设计及原理、产品设计及原理、环境设施设计及原理、工业设计工程基础、工业设计史等专业主干课程和相关系列课程。",
            "测控技术与仪器专业是信息科学技术的源头，是光学、精密机械、电子、电力、自动控制、信号处理、计算机与信息技术多学科互相渗透而形成的一门高新技术密集型综合学科。它的专业面广，小到生产过程自动控制，大到火箭卫星的发射及监控。很多同学认为这属于制造业，实际上由于对自动控制及精度的严格要求，使它归于测控技术与仪器专业。" +
                    "\n该专业培养具备精密仪器设计制造以及测量与控制方面基础知识与应用能力，能在国民经济各部门从事测量与控制领域内有关技术、仪器与系统的设计制造、科技开发、应用研究、运行管理等方面的高级工程技术人才。" +
                    "测控技术与仪器专业以光、机、电、计算机一体化为特色，培养具有现代科学创新意识、知识面宽、基础理论扎实、计算机和外语能力强，可从事计算机应用、电子信息、智能仪器、虚拟仪器、测量与控制等多领域的产品设计制造、科技开发、应用研究、企业管理等多方面的高级工程技术及经营管理人才。同时因为他们专业知识面宽广，具有很强的适应能力和广泛的发展空间，也可从事计量、测试、控制工程、智能仪器仪表、计算机软件和硬件等高新技术领域的设计、制造、开发和应用等工作，转行比较容易。",
            "“热能与动力工程”是多门科学技术的综合，其中包括现代能源科学技术，信息科学技术和管理技术等，主要涉及热能动力设备及系统的设计、运行、自动控制、信息处理、计算机应用、环境保护、制冷空调、能源高效清洁利用和新能源开发等工作，面向及培养知识面广、基础扎实、创新能力强的复合型高级人才。" +
                    "\n本专业学生主要学习动力工程及工程热物理的基础理论，学习各种能量转换及有效利用的理论和技术，受到现代动力工程师的基本训练，具有进行动力机械与热工设备设计、运行、实验研究的基本能力。" +
                    "\n专业主干课程：工程热力学、流体力学、传热学、传热与传质原理、低温技术原理与装置、现代电站锅炉、现代电站汽轮机、发电厂自动化及计算机利用、动力设备与系统、计算机技术（硬件、软件、网络、应用）、计算机控制系统、能源与环境保护、制冷与空调等。",
            "核工程与核技术专业培养具备工程热物理及核工程技术基础知识，能在各相关领域从事核工程及核技术方面的研究、设计、制造、运行、应用和管理的高级工程技术人才。\n" +
                    "核工程与核技术是一门多学科相互交叉的高新技术专业，它包括核动力工程与核能利用、核技术及应用两大分支。" +
                    "\n该专业学生主要学习工程热物理、核工程、核技术的基础理论，受到核工程、核技术方面的实践训练，具有从事核工程、核技术的实验研究、设计建造、运行管理的基本能力。" +
                    "\n由于核能源将成为中国未来能源的绿色支柱，核工程与核技术专业毕业生深受社会欢迎，就业前景良好。就业单位除了传统的核科技、核工程部门外，主要集中在与近代物理技术和信息技术（IT）密切相关的领域与部门。包括在环境、医疗、卫生、国防、工业、农业的政府部门、规划部门和经济管理部门，核电工程的科研设计单位（站、厂、院、所），核动力和核供热以及常规火力电站，工矿企业，高等院校等从事研究、规划、设计、施工、核电厂运行管理及设备制造、研发、技术咨询等工作。",
            "计算机专业涵盖软件工程专业，主要培养具有良好的科学素养，系统地、较好地掌握计算机科学与技术包括计算机硬件、软件与应用的基本理论、基本知识和基本技能与方法，能在科研部门、教育单位、企业、事业、技术和行政管理部门等单位从事计算机教学、科学研究和应用的计算机科学与技术学科的高级科学技术人才。" +
                    "\n该专业学生主要学习计算机科学与技术方面的基本理论和基本知识，接受从事研究与应用计算机的基本训练，具有研究和开发计算机系统的基本能力。" +
                    "\n主干学科:电路原理、模拟电子技术、数字逻辑、数值分析、计算机原理。",
            "通信工程专业培养具备通信技术、通信系统和通信网等方面的知识，能在通信领域中从事研究、设计、制造、运营及在国民经济各部门和国防工业中从事开发、应用通信技术与设备的高级工程技术人才。\n" +
                    "通信工程（也作电信工程，旧称远距离通信工程、弱电工程）是电子工程的一个重要分支，电子信息类子专业，同时也是其中一个基础学科。该学科关注的是通信过程中的信息传输和信号处理的原理和应用。本专业学习通信技术、通信系统和通信网等方面的知识，能在通信领域中从事研究、设计、制造、运营及在国民经济各部门和国防工业中从事开发、应用通信技术与设备。" +
                    "\n该专业学生主要学习通信系统和通信网方面的基础理论、组成原理和设计方法，受到通信工程实践的基本训练，具备从事现代通信系统和网络的设计、开发、调测和工程应用的基本能力。" +
                    "\n主干课程\n" +
                    "电路理论与应用的系列课程、计算机技术系列课程、信号与系统、电磁场理论、数字系统与逻辑设计、数字信号处理、通信原理等。",
            "光电信息工程专业，主要学习光学、机械学、电子学及计算机科学基础理论及专业知识。" +
                    "\n本专业培养以光电信息工程为主干的光电信号获取、光通信、光电信息处理、光存储、光显示及光电信息应用等信息光电子工程领域的基础知识、基础理论、基本技能，能在工农业生产、国防军工、生物医疗、环境监测、文化娱乐、科学研究等领域相关的行业与部门从事光电技术与系统相关产品的设计、制造、开发、应用、研究、教学、管理、营销等方面工作，德、智、体、美全面发展的复合型高级专门人才。" +
                    "\n光电信息技术是由光学、光电子、微电子等技术结合而成的多学科综合技术，涉及光信息的辐射、传输、探测以及光电信息的转换、存储、处理与显示等众多的内容。光电信息技术广泛应用于国民经济和国防建设的各行各业。随着光电信息技术产业的迅速发展，对从业人员和人才的需求逐年增多，因而对光电信息技术 基本知识的需求量也在增加。光电信息技术以其极快的响应速度、极宽的频宽、极大的信息容量以及极高的信息效率和分辨率推动着现代信息技术的发展，从而使光电信息产业在市场的份额逐年增加。在技术发达国家，与光电信息技术相关产业的产值已占国民经济总产值的一半以上，从业人员逐年增多，竞争力也越来越强。",
            "生物医学工程专业培养具备生命科学、电子技术、计算机技术及信息科学有关的基础理论知识以及医学与工程技术相结合的科学研究能力，能在生物医学工程领域、医学仪器以及其它电子技术、计算机技术、信息产业等部门从事研究、开发、教学及管理的高级工程技术人才。\n" +
                    "生物医学工程学科是一门高度综合的交叉学科，这是它最大的特点。生物医学工程它综合工程学、生物学和医学的理论和方法，在各层次上研究人体系统的状态变化，并运用工程技术手段去控制这类变化，其目的是解决医学中的有关问题，保障人类健康，为疾病的预防、诊断、治疗和康复服务。" +
                    "\n生物医学工程专业学生主要学习生命科学、电子技术、计算机技术和信息科学的基本理论和基本知识，受到电子技术、信号检测与处理、计算机技术在医学中的应用的基本训练，具有生物医学工程领域中的研究和开发的基本能力。" +
                    "\n学生就业的主要去向为研究机构，医院影像、设备、临床工程、信息中心等相关科室，医疗器械相关企业、事业单位，政府相关管理部门等。",
            "软件工程专业是2002年国家教育部新增专业，随着计算机应用领域的不断扩大及中国经济建设的不断发展，软件工程专业将成为一个新的热门专业。软件工程专业以计算机科学与技术学科为基础，强调软件开发的工程性，使学生在掌握计算机科学与技术方面知识和技能的基础上熟练掌握从事软件需求分析、软件设计、软件测试、软件维护和软件项目管理等工作所必需的基础知识、基本方法和基本技能，突出对学生专业知识和专业技能的培养，培养能够从事软件开发、测试、维护和软件项目管理的高级专门人才。" +
                    "\n主干学科：马克思主义理论、大学外语、高等数学、大学物理、物理实验、线性代数、概率论与数理统计、程序设计语言、数据结构、离散数学、操作系统、编译技术、软件工程概论、统一建模语言、软件体系结构、软件需求、软件项目管理\n" +
                    "该专业除了学习公共基础课外，还将系统学习离散数学、数据结构、算法分析、面向对象程序设计、现代操作系统、数据库原理与实现技术、编译原理、软件工程、软件项目管理、计算机安全等课程，根据学生的兴趣还可以选修一些其它选修课。",
            "建筑学专业，从广义上来说，是研究建筑及其环境的学科。在通常情况下，以及按其作为外来语所对应的词语（由欧洲至日本再至中国）的本义，它更多的是指与建筑设计和建造相关的艺术和技术的综合。因此，建筑学是一门横跨工程技术和人文艺术的学科。建筑学所涉及的建筑艺术和建筑技术、以及作为实用艺术的建筑艺术所包括的美学的一面和实用的一面，它们虽有明确的不同但又密切联系，并且其分量随具体情况和建筑物的不同而大不相同。" +
                    "\n建筑学的毕业生具备建筑设计、城市设计、室内设计、市政设计等方面的知识和专业技能，能在设计部门从事各项设计工作，在房地产部门从事建筑策划与管理工作，并具有多种职业适应能力的通用型、复合型高级工程技术人才。" +
                    "\n建筑学专业一直是经久不衰的报考热门。据教育部公布的2011年本专科专业就业状况显示，建筑学专业就业率≥90%;毕业生规模约在1万人次至2万人次。\n" +
                    "建筑学是目前就业前景最好的行业之一。在中国这种大兴土木的年代，建筑设计不可能是冷门专业。市场规律和市场价值往往反映到高考的录取上，建筑学是目前高考录取分数最高的专业之一。",
            "环境科学与工程专业学生主要学习普通化学、工程力学、测量学、工程制图、微生物学、水力学、电工学、环境监测、环境工程学科的基本理论和基本知识，受到外语、计算机技术及绘图、污染物监测和分析、工程设计、管理及规划方面的基本训练，具有环境科学技术和给水排水工程领域的科学研究、工程设计和管理规划方面的基本能力。" +
                    "\n环境科学与工程专业学生主要学习生态学方面的基础理论、基本知识，受到基础研究和应用基础研究的科学思维和科学实验训练，具有较好的科学素养，掌握现代生态学理论和计算机模拟等实验技能，初步具备教学、研究、开发和管理能力。" +
                    "\n主干课程:\n" +
                    "机械制图、工程力学、环保设备设计、电工学及实验、仪器分析、化工原理、化工原理实验、化工工艺设计、计算机在化学化工中应用、专业外语、环境科学导论、环境系统工程与优化、环境化学、环境监测、环境质量评价、环境噪声控制、固体废物处理工程、大气污染控制工程、水污染控制工程、环境工程导论、环境质量评价、环境监测、环境监测实验等。",
            "交通工程专业培养富有创新精神和实践能力，具有坚实的基础知识，掌握必备的交通工程、土木工程的基本理论和基本技能，能够在交通工程领域从事交通工程规划、交通工程设计、交通地铁土建施工工程建设管理等方面工作的高级工程技术和科研人才。" +
                    "\n交通工程专业专业学生主要学习系统工程学、交通工程学方面的基本理论和基本知识，受到识图制图、上机操作、工程测量、工程概预算的基本训练，掌握进行交通基础设施规划、设计与工程项目评价方面的基本能力。" +
                    "\n主要课程:\n" +
                    "数学、外语、道路工程制图、工程力学基础、公路土质土力学、交通运输工程、桥隧工程、道路勘测设计、交通工程设计、道路施工监理、道路工程、高速公路管理、工程项目管理、运输物流工程、智能运输系统等。",
            "船舶与海洋工程专业主要培养具备现代船舶与海洋工程设计、研究、建造的基本技能和管理基础知识、计算机编程及应用能力，能在船舶与海洋结构物设计、研究、制造、检验、使用和管理等部门从事技术和管理方面工作的船舶与海洋工程学科高级工程技术人员。" +
                    "\n学生主要学习物理、数学、船舶及海洋工程原理的基本理论和基本知识；掌握船舶与海洋结构物的设计方法；具有船体制图，应用计算机进行科研的初步能力；熟悉船舶与海洋结构物的建造法规和国内外重要船级社的规范；了解造船和海洋开发的理论前沿，新型舰船和海洋结构物的应用前景和发展动态；掌握文献检索、资料查询的基本方法，具有一定的科学研究和实际工作能力。" +
                    "\n船舶与海洋工程这个专业因为开设此专业的院校较少，因此这方面的人才备受欢迎。毕业生到船舶与海洋工程设计研究单位、海事局、国内外船级社、船舶公司、船厂、海洋石油单位、高等院校、船舶运输管理、船舶贸易与经营、海关、海上保险和海事仲裁等部门，从事船舶与海洋结构物设计、研究、制造、检验、使用和管理等工作，也可到相近行业和信息产业有关单位就业。",
            "航空航天工程专业培养具有扎实的数学、物理、力学、计算机等基础理论，掌握航空航天领域的多学科知识，具有良好的综合能力和创新意识，具有全面的文化素质和较强的环境适应能力，能从事航空航天飞行器总体、结构与系统设计等相关工作的高级人才。" +
                    "\n该专业的学生应掌握数学、物理、动力学与控制、空气动力学、材料与结构、工程热力学、控制系统原理、飞行器总体设计、航空电子系统、飞行器制造工艺及设计、实验等方面的基础理论和专业知识，具有飞行器总体、结构与系统设计分析的能力。" +
                    "\n就业方向:\n" +
                    "可从事与航空学有关的科研、技术开发、工程设计、测试、制造、使用、维修和教学工作。",
            "海事管理专业培养具备海洋及内河船舶驾驶、船舶运输管理等方面的知识和技能，能在海洋及内河运输企事业单位从事船舶驾驶、营运管理、港口引航、海事管理及高等学校、科研院所从事教学和科学工作，符合国际海员培训、发证和值班标准公约（STCW78/95）和我国船员适任标准要求并取得高级船员适任证书的高级航海技术及管理人才。" +
                    "\n学生毕业后主要在海事管理机构、对外贸易企业、海事法律、航运企事业单位、货运代理与船舶代理、船舶运输、海事院校科研教学等单位就业。",
    };

    //农学  8
    public static String[] nongxueMajorNames = new String[]{
            "农学","园艺","茶学","应用生物科学","动物科学","动物医学","水产养殖学","海洋渔业科学与技术"
    };
    public static int[] nongxueMajorClass = new int[]{8,8,8,8,8,8,8,8};
    public static String[] nongxueMajorcodes = new String[]{
            "090101","090102","090107T","090109T","090301","090401","090601","090602"
    };
    public static String[] nongxueMajorAbstracts = new String[]{
            "农学是研究农业发展的自然规律和经济规律的科学，因涉及农业环境、作物和畜牧生产、农业工程和农业经济等多种科学而具有综合性，其中林业科学和水产科学有时也包括在广义的农业科学范畴之内。\n" +
                    "农学专业培养具备作物生产、作物遗传育种以及种子生产与经营管理等方面的基本理论、基本知识和基本技能，能在农业及其它相关的部门或单位从事与农学有关的技术与设计、推广与开发、经营与管理、教学与科研等工作的高级科学技术人才。" +
                    "\n主干课程:\n" +
                    "植物生理与生物化学、应用概率统计、遗传学、田间试验设计、农业生态学、作物栽培与耕作学、育种学、种子学、农业经济管理、农业推广学、植物病虫害学。",
            "园艺专业培养具备生物学和园艺学的基本理论、基本知识和基本技能，能在农业、商贸、园林管理等领域和部门从事与园艺科学有关的技术与设计、推广与开发、经营与管理、教学与科研等工作的高级科学技术人才。" +
                    "\n园艺学，是研究园艺作物的种质资源、生长发育规律、繁殖、栽培、育种、贮藏、加工、病虫以及造园等的科学。\n" +
                    "随着科学技术的发展，园艺学的研究内容与分工也更加具体。园艺学的范畴一般分为果树园艺学、蔬菜园艺学、观赏园艺学和造园学四大类，也有的学者将园艺学分为五大类，即将苗圃学单列一类。" +
                    "\n主干课程：植物学、生物化学、植物生理学、植物生理与生物化学、应用概率统计、遗传学、土壤学、农业生态学、园艺植物育种学、园艺植物栽培学、园艺植物病虫害防治学、园艺产品贮藏加工、农业气象学、微生物与植物病原学、植物病理学、昆虫学、植物生物技术导论、分子生物学导论、计算机农业应用、园艺作物育种学、园艺作物栽培学、设施园艺学、园艺商品学、园艺产品采后与营销等。",
            "茶学研究的内容，从大的方面来划分，可以划分作两大部分：茶科学和茶文化学。该专业的培养目标是重点培养具备农业生物科学、食品科学和茶学等方面的基本理论、基本知识和基本技能，能在农业、工业、商贸等领域或部门从事与茶学有关的技术与设计、推广与开发、经营与管理、教学与科研等工作的高级科学技术人才。" +
                    "\n该专业学生主要学习农业生物科学、食品科学、茶学方面的基本理论和基本知识，受到茶树栽培育种和茶叶生产、营销等方面的基本训练，具有茶树栽培育种、茶叶生产、茶的综合利用和营销方面的基本能力。" +
                    "\n主要课程：植物生理与生物化学、应用概率统计、遗传学、土壤学、农业生态学、茶树栽培与育种学、茶叶生物化学、茶叶机械、茶叶加工学、茶叶审评与检验、经济管理与营销。",
            "应用生物科学专业注重培养和造就能从事生物资源利用、食品、医药、环境保护等相关领域的技术与设计、应用与开发、经营与管理、教学与科研等工作的高级科学技术人才。" +
                    "\n注重科学基础与工程实践教学，培养具有创新素质和国际视野，掌握现代食品科学基础理论和食品工程技术知识，具备科学研究与技术管理能力，能在食品生产、流通与行业监管领域从事规划管理、科学研究、产品开发、工程设计、技术管理、安全性与品质控制等方面工作的高素质复合型食品科学与工程技术人才。" +
                    "\n学生主要学习物理、化学、生物学与食品工程学的基础理论和基本知识，接受食品科学研究、工程设计与生产技术管理能力的基本训练。",
            "动物科学专业是生命科学的重要分支。它的基本任务是在认识和掌握动物遗传变异、生长发育、繁殖消化代谢等生命规律的基础上，为人类提供质优量多的动物产品。" +
                    "\n随着科技的进步，动物科学的研究领域在范围上已从传统的畜牧业扩展到了水产动物、珍禽异兽、伴侣动物、观赏动物的饲养、育种繁殖、产品加工等各个领域；在研究深度上已从动物整体水平、细胞水平和亚细胞水平深入到分子水平，使得人们可以在基因水平上认识动物遗传、发育、繁殖、代谢的规律。克隆动物、转基因动物、嵌合体动物的成功育成表明，动物科学是21世纪生命科学中最富有挑战性和最具发展潜力的领域之一。" +
                    "\n学生主要学习动物生产与管理、动物遗传育种、动物繁殖、动物营养与饲料等\n" +
                    "动物科学专业\n" +
                    "动物科学专业\n" +
                    "方面的基本理论和基本知识，受到与动物科学相关的调查、分析、评估、设计等力面的基本训练，具有动物育种、繁殖、生产与管理的基本能力。",
            "动物医学专业通俗来说，就是培养“兽医”的专业，它是以生物学为基础，研究动物（包括研究动物）疾病的发生发展规律，并在此基础上对疾病进行诊断和防治，保障动物健康的综合性学科。" +
                    "\n与其他医学类专业类似，动物医学首先要学习基础生物学和医学理论，然后通过大量解剖实验强化学生对理论的理解。有一年左右的临床实习期，保证学生最终掌握各类治疗动物特产类的方法。" +
                    "\n主要课程：动物解剖与组织胚胎学、动物生理学、动物生物化学、兽医病理学、兽医药理学、兽医微生物学与免疫学、兽医内科学、兽医外科学、动物寄生虫学，寄生虫病学，动物传染病学，特种经济动物学，兽医产科学等。",
            "水产养殖学专业培养具备水产动、植物增养殖科学等方面的基本理论、基本知识和基本技能，能在水产养殖生产、教育、科研和管理等部门从事科学研究、教学、水产养殖开发、管理等工作的高级科学技术人才。" +
                    "\n该专业学生主要学习生物学和水域环境学的基本理论以及水产增养殖、渔业经济和管理等方面的基本知识，受到有关生物学和化学实验教学、水产增养殖实践性环节、微型计算机应用等方面的基本训练，具有水产经济动、植物增养殖技术、营养与饲料和病害防治等方面的基本能力。" +
                    "\n主干课程:\n" +
                    "鱼类增养殖学、甲壳动物增养殖学、水产动物育种学、水产动物营养与饲料、水产动物疾病防治、海藻与海藻栽培学、水环境化学等。",
            "海洋渔业科学与技术专业学生主要学习渔业资源与渔场学、海洋环境学、渔具渔法学、渔业法规与渔政管理等的基本理论和基本知识，受到船舶驾驶技术、网具装配技术、捕捞技术、渔场调查、渔业水域环境监测和渔政管理等方面的基本训练，具有渔业资源与渔业环境的调查和研究、渔具渔法设计和渔业管理的基本能力。" +
                    "\n主干课程:\n" +
                    "水生生物学、鱼类学、渔具渔法学、渔具理论与设计、航海技术、渔业资源与渔场学、渔业资源评估、海洋环境调查和监测、渔业法规与渔政管理。"
    };

    //医学  9
    public static String[] yixueMajorNames = new String[]{
            "中医学","临床医学","法医学","护理学","药学","口腔医学","放射医学","营养学","精神医学"
    };
    public static int[] yixueMajorClass = new int[]{9,9,9,9,9,9,9,9,9};
    public static String[] yixueMajorcodes = new String[]{
            "100501K","100201K","100901K","101101","1007","100401","100206TK","100204S","100205TK"
    };
    public static String[] yixueMajorAbstracts = new String[]{
            "中医学专业培养系统掌握中医学基本理论知识和基本技能，适应现代中医学发展和高等中医教育需要，具备良好的人文和自然科学素养、扎实的西医学基本理论和基本技能、一定的中药学及预防医学相关知识，具有较强临床思维能力和临床实践能力的中医学专门人才。" ,
            "临床医学专业是一门实践性很强的应用科学专业。它致力于培养具备基础医学、临床医学的基本理论和医疗预防的基本技能；能在医疗卫生单位、医学科研等部门从事医疗及预防、医学科研等方面工作的医学高级专门人才。该专业学生主要学习医学方面的基础理论和基本知识，人类疾病的诊断、治疗、预防方面的基本训练．具有对人类疾病的病因、发病机制做出分类鉴别的能力。" +
                    "\n本专业学生主要学习医学方面的基础理论和基本知识，受到人类疾病的诊断、治疗、预防方面的基本训练．具有对人类疾病的病因、发病机制作出分类鉴别的能力。" +
                    "\n主要课程：人体解剖学、组织学与胚胎学、生物化学、神经生物学、生理学、医学微生物学、医学免疫学、病理学、药理学、人体形态学实验、医学生物学实验、医学机能学实验、病原生物学与免疫学实验、诊断学、内科学、外科学、妇产科学、儿科学；循证医学、卫生法学、医学伦理学、医学心理学、医患沟通与技巧；马克思主义基本原理、思想道德修养；英语、高等数学、医用物理学、化学等。",
            "法医学专业培养具备医学的基本理论知识和系统的法医学理论知识及基本技能，能在公安、政法机关、司法鉴定机构和保险公司从事法医学检案鉴定工作的高级科学技术人才。\n" +
                    "专业学生主要学习基础医学、临床医学、法学及法医学的基本理论及基本知识，受到医学及法医学的基本技能训练，具有法医学检案鉴定的基本能力。" +
                    "\n本专业学生主要学习基础医学、临床医学、法学及法医学的基本理论及基本知识，受到医学及法医学的基本技能训练，具有法医学检案鉴定的基本能力。",
            "护理学专业培养具备人文社会科学、医学、预防保健的基本知识及护理学的基本理论知识和技能，能在护理领域内从事临床护理、预防保健、护理管理、护理教学和护理科研的高级专门人才。" +
                    "\n该专业学生主要学习相关的人文社会科学知识和医学基础、预防保健的基本理论知识，受到护理学的基本理论、基本知识和临床护理技能的基本训练，具有对服务对象实施整体护理及社区健康服务的基本能力。" +
                    "\n主干课程:\n" +
                    "人体解剖学、生理学、医学伦理学、心理学、病因学、药物治疗学、诊断学基础、护理学基础、急重症护理、内外科护理学、妇儿科护理学、精神护理学等。",
            "药学（Pharmacy）专业培养具备药学学科基本理论、基本知识和实验技能，能在药品生产、检验、流通、使用和研究与开发领域从事鉴定、药物设计、一般药物制剂及临床合理用药等方面工作的高级科学技术人才。 业务培养要求：本专业学生主要学习药学各主要分支学科的基本理论和基本知识，受到药学实验方法和技能的基本训练，具有药物制备、质量控制评价及指导合理用药的基本能力。" +
                    "\n药学专业培养具备药学学科基本理论、基本知识和实验技能，能在药品生产、检验、流通、使用和研究与开发领域从事鉴定、药物设计、一般药物制剂及临床合理用药等方面工作的高级科学技术人才。 药学专业学生主要学习药学各主要分支学科的基本理论和基本知识，受到药学实验方法和技能的基本训练，具有药物制备、质量控制评价及指导合理用药的基本能力。" +
                    "\n药学专业毕业生主要到制药厂和医药研究所从事各类药物开发、研究、生产质量保证和合理用药等方面的工作，也有很多人从事药品销售代理。",
            "口腔医学专业学生主要学习口腔医学的基本理论和基本知识，受到口腔及颌面部疾病的诊断、治疗、预防方面的训练，具有口腔常见病、多发病的诊疗、修复和预防保健的基本能力。" +
                    "\n本专业学生主要学习口腔医学的基本理论和基本知识，受到口腔及颌面部疾病的诊断、治疗、预防方面的训练，具有口腔常见病、多发病的诊疗、修复和预防保健的基本能力。",
            "放射医学是医学中的一门学科，其主要任务是研究电离辐射对人体的作用、机制、损伤与修复的规律，放射损伤的诊断、治疗和预防，为放射性工作人员的卫生防护、医学监督和保健工作提供理论依据和措施。" +
                    "\n主干课程:\n" +
                    "解剖学、组织与胚胎学、病原学、免疫学、生物化学、生理学、病理学、药理学、临床医学导论、内科学、外科学、预防医学、放射医学及防护、影像诊断学、肿瘤放射治疗学、核医学。",
            "营养学是一门研究机体代谢与食物营养素之间的关系的一门学科。通过对营养学的历史、起源、发展、特征、层次等方面的描述，可以知道营养学的发展脉略。营养学对社会、家庭‘行业、健康、政策具有深远影响。" +
                    "\n营养学是研究食物与机体的相互作用，以及食物营养成分（包括营养素、非营养素、抗营养素等成分）在机体里分布、运输、消化、代谢等方面的一门学科。",
            "精神医学是临床医学的分支，是研究人类各种心理障碍、精神病的病因、发病机制、临床特点和防治方法的一门临床学科，旨在探索人类精神世界的奥秘，以促进人类的精神健康。" +
                    "\n本专业要求学生掌握基础医学、临床医学、临床心理学及精神病的基本理论和诊疗技能，具有一般医疗技能和处理常见的心理障碍、行为障碍、精神疾病及相关疑难急重症的能力。\n" +
                    "本专业的就业前景还可以，毕业生主要到各级医药院校、综合医院、脑科医院、医学心理中心及精神卫生保健机构从事医疗、教学和科研工作等。"
    };

    //管理学 10
    public static String[] guanlixueMajorNames = new String[]{
            "工商管理","会计学","人力资源管理","市场营销","财务管理","物流管理","国际商务","公共关系学","信息资源管理"
    };
    public static int[] guanlixueMajorClass = new int[]{10,10,10,10,10,10,10,10,10};
    public static String[] guanlixueMajorcodes = new String[]{
            "120201K","B020204","120206","110202","120204","120601","120205","120212T","120503"
    };
    public static String[] guanlixueMajorAbstracts = new String[]{
            "工商管理专业依靠先进的教学设施，科学的教学方法，完备的教学环节，广泛的社会实践，全面提高学生的政治素质和业务素质，为现代工商企业培养理论基础扎实、适应性强、动手能力突出的高级综合管理人才。\n" +
                    "该专业要求学生全面掌握企业战略、人力资源管理、国际商务等方面的理论知识；注重战略管理、人际沟通、推销谈判技巧等方面技能训练。同时注重管理者的素质和能力开发，包括决策能力、公关能力、咨询诊断能力、组织指挥能力、涉外经营能力等。",
            "会计学专业属工商管理学科，是一个应用性较强的专业。该专业设有企业会计、国际会计、注册会计师等三个专业方向。专业以企业会计为主，兼顾计算机与财务管理。在教学方法上强调理论与实践相结合的教学模式，提倡启发式与案例教学，多方位培养学生处理会计业务与管理财务的操作能力和创新能力。" +
                    "\n该专业培养具备管理、经济、法律和会计学等方面的知识和能力，能在企、事业单位及政府部门从事会计实务以及教学、科研方面工作的工商管理学科高级专门人才。" +
                    "\n主要课程：管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、财务会计、成本会计、管理会计、审计学。主要学中级财务会计、高级财务会计、财务管理等；基础课有管理学、宏观经济学、微观经济学等课程。",
            "人力资源管理专业培养具备管理、经济、法律及人力资源管理等方面的知识和能力，能在事业单位及政府部门从事人力资源管理以及教学、科研方面工作的工商管理学科专门人才。" +
                    "\n该专业学生需要学习管理学、经济学及人力资源管理方面的基本理论和基本知识，受到人力资源管理方法与技巧方面的基本训练，具有分析和解决人力资源管理问题的基本能力。",
            "本专业培养具备管理、经济、法律、市场营销等方面的知识和能力，能在企、事业单位及政府部门从事市场营销与管理以及教学、科研方面工作的工商管理学科高级专门人才。" +
                    "\n本专业学生主要学习市场营销及工商管理方面的基本理论和基本知识，受到营销方法与技巧方面的基本训练，具有分析和解决营销问题的基本能力。",
            "财务管理专业培养具备管理、经济、法律和理财、金融等方面的知识和能力，能在工商、金融企业、事业单位及政府部门从事财务、金融管理以及教学、科研方面工作的工商管理学科高级专门人才。" +
                    "\n该专业学生主要学习财务、金融管理方面的基本理论和基本知识，受到财务、金融管理方法和技巧方面的基本训练，具有分析和解决财务、金融问题的基本能力。",
            "物流管理（Logistics Management）是指在社会再生产过程中，根据物质资料实体流动的规律，应用管理的基本原理和科学方法，对物流活动进行计划、组织、指挥、协调、控制和监督，使各项物流活动实现最佳的协调与配合，以降低物流成本，提高物流效率和经济效益。现代物流管理是建立在系统论、信息论和控制论的基础上的。" +
                    "\n该专业学生主要学习经济、会计、贸易、管理、法律、信息资源管理、计算机等方面的基本理论和专门知识，培养具有一定的物流规划与设计、物流管理、物流业运作等能力，能在经济管理部门、贸易公司、物流企业从事政策制定，物流业运作管理应用型、复合型、国际化的物流管理人才。",
            "国际商务专业，是国家为适应二十一世纪国际贸易发展需要，增强国家竞争力而设立的学科。" +
                    "\n国际商务专业学生具有法商结合的知识结构，理论知识扎实，并有较强的实际操作能力和用外语进行商务沟通的能力，适于在跨国公司、外向型企业和外资企业等从事国际商务活动的商务代表、单证员、国际商务师及国际化经营的高级管理人才；",
            "公共关系学是一门新兴的综合性的社会科学，在一些经济发达国家公共关系理论已被广泛应用于各个领域，用于指导各类组织的社会实践活动，并以它特有的价值和作用，受到人们的普遍关注。" +
                    "\n该专业学生主要学习公共关系学的基本知识和基本理论，受到专业技能的训练，具有从事政府部门、企事业单位或社会团体的信息咨询传播管理工作，以及教学科研工作的能力。",
            "信息资源管理专业培养通晓内外贸理论与实务，根据数字时代信息资源管理所需专业知识与基本技能的要求，具备信息资源集成管理和电子政务系统知识与技能，在国家机关、企业、事业单位及其他社会组织从事信息组织、信息资源的开发、利用、管理与咨询服务等工作的高级复合型人才。" +
                    "\n主要课程:\n" +
                    "微观经济学、宏观经济学、计量经济学、现代商业技术、电子商务概论、信息管理基础、信息资源建设、信息资源服务、信息描述与组织、信息检索与利用、信息分析与预测、管理信息系统、数据库技术与应用、网络技术与应用、理论信息学、知识管理、管理学等。"
    };

    //艺术学 6
    public static String[] yishuxueMajorNames = new String[]{
            "艺术设计","戏剧学","舞蹈学","导演","表演","音乐学"
    };
    public static int[] yishuxueMajorClass = new int[]{11,11,11,11,11,11};
    public static String[] yishuxueMajorcodes = new String[]{
            "130501","130302","130205","050413"," 130301","130202"
    };
    public static String[] yishuxueMajorAbstracts = new String[]{
            "艺术设计专业培养具备艺术设计学教学和研究等方面的知识和能力，能在艺术设计教育、研究、设计、出版和文博等单位从事艺术设计学教学、研究、编辑等方面工作的专门人才。" +
                    "\n艺术设计专业：包括平面设计专业、环境艺术设计专业、电脑艺术设计专业、装潢艺术设计专业、工业设计（艺术类）、动画专业 服装设计，展示设计等。" +
                    "\n主要课程：艺术设计概论、艺术设计美学、中国艺术设计史、外国艺术设计史、中国工艺美术史、外国工艺美术史、艺术考古学、艺术设计基础等.",
            "戏剧学是一门新兴学科，属于艺术学下的一个本科专业。本专业培养具备戏剧和影视的理论、评论、编辑和艺术管理等力面的知识。" +
                    "\n本专业学生应具有扎实的马克思主义的基本理论，熟悉我国的文艺方针、政策，系统地掌握戏剧、影视文学的基本理论和创作技能，了解相关学科的知识，有较好的文化艺术修养，较强的审美感觉和创造性思维；具有较系统和广博的戏剧影视理论和历史知识，掌握分析和研究戏剧影视作品的方法，有较强的理论写作能力。",
            "舞蹈学专业培养具备能从事中外舞蹈史、舞蹈理论的研究、舞蹈教学以及编辑等工作的高等专门人才。本专业培养能在学校、艺术团体、艺术（文化）馆，青少年宫等单位从事朝鲜民族舞蹈、中国民间舞、芭蕾舞的教学、创作、辅导工作的德、智、体全面发展的高级朝鲜民族舞蹈艺术人才和“复合型”专门应用人才。" +
                    "\n主干课程:\n" +
                    "舞蹈写作教程、舞蹈形态学、中国舞蹈史、中国民间舞蹈文化、 世界芭蕾史纲、欧美现代舞史、舞蹈专业英语、舞蹈文献检索与利用、中国舞蹈意象论、中 外舞蹈思想教程、舞蹈解剖学等。",
            "导演专业：具备戏剧、戏曲导演、电影、电视剧导演和表演、戏剧理论研究等方面的知识，能在剧院（团）、电影制片厂、电视台、电视剧制作中心等部门从事戏剧、戏曲艺术、电影、电视剧制作等方面导演工作和理论研究工作的高级专门人才。" +
                    "\n主要课程：导演基础、电视节目制作、戏剧、戏曲及电影表演学、导演艺术、电影电视画面、视听语言、中外戏剧史、艺术概论等。",
            "表演专业培养具有一定的马克思主义基本理论素养，并具备和掌握表演艺术的基本理论和基本技巧，能够在戏剧、戏曲、电影、电视和舞蹈等表演中独立完成不同人物形象创作的高级专门人才。" +
                    "\n主干课程:\n" +
                    "表演基础理论、表演基本技能、表演剧目、艺术理论、文学修养课程。",
            "音乐学是研究音乐的所有理论学科的总称；音乐学在不同时期的研究对象和侧重点是不同的，音乐学除了基本的研究对象外，还研究历史和现在的一切个人和民族的音乐行为，即音乐的生理行为、创造行为、表演行为、审美行为、接受行为、和学习行为。音乐学专业学生主要学习音乐史论、音乐教育等方面的基本理论和基础知识，接受音乐理论与实践方面的基本训练，具有音乐研究、教学等方面的基本能力。" +
                    "\n主干课程:\n" +
                    "音乐史、音乐学理论、中外民族民间音乐、教育学、美学、作曲技术理论、钢琴或其他乐器演奏等。"
    };



    //此定义要放在后面
    public static Object[] allMajorNames = new Object[]{zhexueMajorNames,jingjixueMajorNames,faxueMajorNames,jiaoyuxueMajorNames,wenxueMajorNames,lishixueMajorNames,lixueMajorNames,gongxueMajorNames,nongxueMajorNames,yixueMajorNames,guanlixueMajorNames,yishuxueMajorNames};
    public static Object[] allMajorCodes = new Object[]{zhexueMajorcodes,jingjixueMajorcodes,faxueMajorcodes,jiaoyuxueMajorcodes,wenxueMajorcodes,lishixueMajorcodes,lixueMajorcodes,gongxueMajorcodes,nongxueMajorcodes,yixueMajorcodes,guanlixueMajorcodes,yishuxueMajorcodes};
    public static Object[] allMajorClass = new Object[]{zhexueMajorClass,jingjixueMajorClass,faxueMajorClass,jiaoyuxueMajorClass,wenxueMajorClass,lishixueMajorClass,lixueMajorClass,gongxueMajorClass,nongxueMajorClass,yixueMajorClass,guanlixueMajorClass,yishuxueMajorClass};
    public static Object[] allMajorAbstracts = new Object[]{zhexueMajorAbstracts,jingjixueMajorAbstracts,faxueMajorAbstracts,jiaoyuxueMajorAbstracts,wenxueMajorAbstracts,lishixueMajorAbstracts,lixueMajorAbstracts,gongxueMajorAbstracts,nongxueMajorAbstracts,yixueMajorAbstracts,guanlixueMajorAbstracts,yishuxueMajorAbstracts};

}














